<?xml version="1.0" ?>
<net batch="1" name="single-image-super-resolution-0063" version="4">
	<layers>
		<layer id="0" name="0" precision="FP32" type="Input">
			<output>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="112" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="9,9" output="32" pads_begin="4,4" pads_end="4,4" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
			<blobs>
				<weights offset="0" size="31104"/>
			</blobs>
		</layer>
		<layer id="2" name="113" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="114" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
			<blobs>
				<weights offset="31104" size="36864"/>
			</blobs>
		</layer>
		<layer id="4" name="117/InstanceNormalization/MVN" precision="FP32" type="MVN">
			<data across_channels="0" eps="9.999999747378752e-06" normalize_variance="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="117/InstanceNormalization/Mul/FusedScaleShift_" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
			<blobs>
				<weights offset="67968" size="128"/>
				<biases offset="68096" size="128"/>
			</blobs>
		</layer>
		<layer id="6" name="118" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="119" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
			<blobs>
				<weights offset="68224" size="36864"/>
			</blobs>
		</layer>
		<layer id="8" name="122/InstanceNormalization/MVN" precision="FP32" type="MVN">
			<data across_channels="0" eps="9.999999747378752e-06" normalize_variance="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="122/InstanceNormalization/Mul/FusedScaleShift_" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
			<blobs>
				<weights offset="105088" size="128"/>
				<biases offset="105216" size="128"/>
			</blobs>
		</layer>
		<layer id="10" name="123" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="124" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
			<blobs>
				<weights offset="105344" size="36864"/>
			</blobs>
		</layer>
		<layer id="12" name="127/InstanceNormalization/MVN" precision="FP32" type="MVN">
			<data across_channels="0" eps="9.999999747378752e-06" normalize_variance="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="127/InstanceNormalization/Mul/FusedScaleShift_" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
			<blobs>
				<weights offset="142208" size="128"/>
				<biases offset="142336" size="128"/>
			</blobs>
		</layer>
		<layer id="14" name="128" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="129" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
			<blobs>
				<weights offset="142464" size="36864"/>
			</blobs>
		</layer>
		<layer id="16" name="132/InstanceNormalization/MVN" precision="FP32" type="MVN">
			<data across_channels="0" eps="9.999999747378752e-06" normalize_variance="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="132/InstanceNormalization/Mul/FusedScaleShift_" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
			<blobs>
				<weights offset="179328" size="128"/>
				<biases offset="179456" size="128"/>
			</blobs>
		</layer>
		<layer id="18" name="133" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="134" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
			<blobs>
				<weights offset="179584" size="36864"/>
			</blobs>
		</layer>
		<layer id="20" name="137/InstanceNormalization/MVN" precision="FP32" type="MVN">
			<data across_channels="0" eps="9.999999747378752e-06" normalize_variance="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="137/InstanceNormalization/Mul/FusedScaleShift_" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
			<blobs>
				<weights offset="216448" size="128"/>
				<biases offset="216576" size="128"/>
			</blobs>
		</layer>
		<layer id="22" name="138" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="139" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
			<blobs>
				<weights offset="216704" size="36864"/>
			</blobs>
		</layer>
		<layer id="24" name="142/InstanceNormalization/MVN" precision="FP32" type="MVN">
			<data across_channels="0" eps="9.999999747378752e-06" normalize_variance="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="142/InstanceNormalization/Mul/FusedScaleShift_" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
			<blobs>
				<weights offset="253568" size="128"/>
				<biases offset="253696" size="128"/>
			</blobs>
		</layer>
		<layer id="26" name="143" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="144" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
			<blobs>
				<weights offset="253824" size="36864"/>
			</blobs>
		</layer>
		<layer id="28" name="147/InstanceNormalization/MVN" precision="FP32" type="MVN">
			<data across_channels="0" eps="9.999999747378752e-06" normalize_variance="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="147/InstanceNormalization/Mul/FusedScaleShift_" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
			<blobs>
				<weights offset="290688" size="128"/>
				<biases offset="290816" size="128"/>
			</blobs>
		</layer>
		<layer id="30" name="148" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="149" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
			<blobs>
				<weights offset="290944" size="36864"/>
			</blobs>
		</layer>
		<layer id="32" name="152/InstanceNormalization/MVN" precision="FP32" type="MVN">
			<data across_channels="0" eps="9.999999747378752e-06" normalize_variance="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="152/InstanceNormalization/Mul/FusedScaleShift_" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
			<blobs>
				<weights offset="327808" size="128"/>
				<biases offset="327936" size="128"/>
			</blobs>
		</layer>
		<layer id="34" name="153" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="154" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
			<blobs>
				<weights offset="328064" size="36864"/>
			</blobs>
		</layer>
		<layer id="36" name="157/InstanceNormalization/MVN" precision="FP32" type="MVN">
			<data across_channels="0" eps="9.999999747378752e-06" normalize_variance="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="157/InstanceNormalization/Mul/FusedScaleShift_" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
			<blobs>
				<weights offset="364928" size="128"/>
				<biases offset="365056" size="128"/>
			</blobs>
		</layer>
		<layer id="38" name="158" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="159" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
			<blobs>
				<weights offset="365184" size="36864"/>
			</blobs>
		</layer>
		<layer id="40" name="162/InstanceNormalization/MVN" precision="FP32" type="MVN">
			<data across_channels="0" eps="9.999999747378752e-06" normalize_variance="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="162/InstanceNormalization/Mul/FusedScaleShift_" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
			<blobs>
				<weights offset="402048" size="128"/>
				<biases offset="402176" size="128"/>
			</blobs>
		</layer>
		<layer id="42" name="163" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="164" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
			<blobs>
				<weights offset="402304" size="36864"/>
			</blobs>
		</layer>
		<layer id="44" name="167/InstanceNormalization/MVN" precision="FP32" type="MVN">
			<data across_channels="0" eps="9.999999747378752e-06" normalize_variance="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="167/InstanceNormalization/Mul/FusedScaleShift_" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
			<blobs>
				<weights offset="439168" size="128"/>
				<biases offset="439296" size="128"/>
			</blobs>
		</layer>
		<layer id="46" name="168" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="169" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
			<blobs>
				<weights offset="439424" size="36864"/>
			</blobs>
		</layer>
		<layer id="48" name="172/InstanceNormalization/MVN" precision="FP32" type="MVN">
			<data across_channels="0" eps="9.999999747378752e-06" normalize_variance="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="172/InstanceNormalization/Mul/FusedScaleShift_" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
			<blobs>
				<weights offset="476288" size="128"/>
				<biases offset="476416" size="128"/>
			</blobs>
		</layer>
		<layer id="50" name="173" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="174" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
			<blobs>
				<weights offset="476544" size="36864"/>
			</blobs>
		</layer>
		<layer id="52" name="177/InstanceNormalization/MVN" precision="FP32" type="MVN">
			<data across_channels="0" eps="9.999999747378752e-06" normalize_variance="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="177/InstanceNormalization/Mul/FusedScaleShift_" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
			<blobs>
				<weights offset="513408" size="128"/>
				<biases offset="513536" size="128"/>
			</blobs>
		</layer>
		<layer id="54" name="178" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="179" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
			<blobs>
				<weights offset="513664" size="36864"/>
			</blobs>
		</layer>
		<layer id="56" name="182/InstanceNormalization/MVN" precision="FP32" type="MVN">
			<data across_channels="0" eps="9.999999747378752e-06" normalize_variance="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="182/InstanceNormalization/Mul/FusedScaleShift_" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
			<blobs>
				<weights offset="550528" size="128"/>
				<biases offset="550656" size="128"/>
			</blobs>
		</layer>
		<layer id="58" name="183" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="184" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
			<blobs>
				<weights offset="550784" size="36864"/>
			</blobs>
		</layer>
		<layer id="60" name="187/InstanceNormalization/MVN" precision="FP32" type="MVN">
			<data across_channels="0" eps="9.999999747378752e-06" normalize_variance="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="187/InstanceNormalization/Mul/FusedScaleShift_" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
			<blobs>
				<weights offset="587648" size="128"/>
				<biases offset="587776" size="128"/>
			</blobs>
		</layer>
		<layer id="62" name="188" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="189" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
			<blobs>
				<weights offset="587904" size="36864"/>
			</blobs>
		</layer>
		<layer id="64" name="192/InstanceNormalization/MVN" precision="FP32" type="MVN">
			<data across_channels="0" eps="9.999999747378752e-06" normalize_variance="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="192/InstanceNormalization/Mul/FusedScaleShift_" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
			<blobs>
				<weights offset="624768" size="128"/>
				<biases offset="624896" size="128"/>
			</blobs>
		</layer>
		<layer id="66" name="193" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="194" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
			<blobs>
				<weights offset="625024" size="36864"/>
			</blobs>
		</layer>
		<layer id="68" name="197/InstanceNormalization/MVN" precision="FP32" type="MVN">
			<data across_channels="0" eps="9.999999747378752e-06" normalize_variance="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="197/InstanceNormalization/Mul/FusedScaleShift_" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
			<blobs>
				<weights offset="661888" size="128"/>
				<biases offset="662016" size="128"/>
			</blobs>
		</layer>
		<layer id="70" name="198" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="199" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
			<blobs>
				<weights offset="662144" size="36864"/>
			</blobs>
		</layer>
		<layer id="72" name="202/InstanceNormalization/MVN" precision="FP32" type="MVN">
			<data across_channels="0" eps="9.999999747378752e-06" normalize_variance="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="202/InstanceNormalization/Mul/FusedScaleShift_" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
			<blobs>
				<weights offset="699008" size="128"/>
				<biases offset="699136" size="128"/>
			</blobs>
		</layer>
		<layer id="74" name="203" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="204" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
			<blobs>
				<weights offset="699264" size="36864"/>
			</blobs>
		</layer>
		<layer id="76" name="207/InstanceNormalization/MVN" precision="FP32" type="MVN">
			<data across_channels="0" eps="9.999999747378752e-06" normalize_variance="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="207/InstanceNormalization/Mul/FusedScaleShift_" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
			<blobs>
				<weights offset="736128" size="128"/>
				<biases offset="736256" size="128"/>
			</blobs>
		</layer>
		<layer id="78" name="208" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="209" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
			<blobs>
				<weights offset="736384" size="36864"/>
			</blobs>
		</layer>
		<layer id="80" name="212/InstanceNormalization/MVN" precision="FP32" type="MVN">
			<data across_channels="0" eps="9.999999747378752e-06" normalize_variance="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="212/InstanceNormalization/Mul/FusedScaleShift_" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
			<blobs>
				<weights offset="773248" size="128"/>
				<biases offset="773376" size="128"/>
			</blobs>
		</layer>
		<layer id="82" name="213" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="214" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
			<blobs>
				<weights offset="773504" size="36864"/>
			</blobs>
		</layer>
		<layer id="84" name="217/InstanceNormalization/MVN" precision="FP32" type="MVN">
			<data across_channels="0" eps="9.999999747378752e-06" normalize_variance="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="217/InstanceNormalization/Mul/FusedScaleShift_" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
			<blobs>
				<weights offset="810368" size="128"/>
				<biases offset="810496" size="128"/>
			</blobs>
		</layer>
		<layer id="86" name="218" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="219" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
			<blobs>
				<weights offset="810624" size="36864"/>
			</blobs>
		</layer>
		<layer id="88" name="222/InstanceNormalization/MVN" precision="FP32" type="MVN">
			<data across_channels="0" eps="9.999999747378752e-06" normalize_variance="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="222/InstanceNormalization/Mul/FusedScaleShift_" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
			<blobs>
				<weights offset="847488" size="128"/>
				<biases offset="847616" size="128"/>
			</blobs>
		</layer>
		<layer id="90" name="223" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="224" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
			<blobs>
				<weights offset="847744" size="36864"/>
			</blobs>
		</layer>
		<layer id="92" name="227/InstanceNormalization/MVN" precision="FP32" type="MVN">
			<data across_channels="0" eps="9.999999747378752e-06" normalize_variance="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="227/InstanceNormalization/Mul/FusedScaleShift_" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
			<blobs>
				<weights offset="884608" size="128"/>
				<biases offset="884736" size="128"/>
			</blobs>
		</layer>
		<layer id="94" name="228" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="229" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
			<blobs>
				<weights offset="884864" size="36864"/>
			</blobs>
		</layer>
		<layer id="96" name="232/InstanceNormalization/MVN" precision="FP32" type="MVN">
			<data across_channels="0" eps="9.999999747378752e-06" normalize_variance="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="232/InstanceNormalization/Mul/FusedScaleShift_" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
			<blobs>
				<weights offset="921728" size="128"/>
				<biases offset="921856" size="128"/>
			</blobs>
		</layer>
		<layer id="98" name="233" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="234" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
			<blobs>
				<weights offset="921984" size="36864"/>
			</blobs>
		</layer>
		<layer id="100" name="237/InstanceNormalization/MVN" precision="FP32" type="MVN">
			<data across_channels="0" eps="9.999999747378752e-06" normalize_variance="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="237/InstanceNormalization/Mul/FusedScaleShift_" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
			<blobs>
				<weights offset="958848" size="128"/>
				<biases offset="958976" size="128"/>
			</blobs>
		</layer>
		<layer id="102" name="238" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="239" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
			<blobs>
				<weights offset="959104" size="36864"/>
			</blobs>
		</layer>
		<layer id="104" name="242/InstanceNormalization/MVN" precision="FP32" type="MVN">
			<data across_channels="0" eps="9.999999747378752e-06" normalize_variance="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="242/InstanceNormalization/Mul/FusedScaleShift_" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
			<blobs>
				<weights offset="995968" size="128"/>
				<biases offset="996096" size="128"/>
			</blobs>
		</layer>
		<layer id="106" name="243" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="244" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
			<blobs>
				<weights offset="996224" size="36864"/>
			</blobs>
		</layer>
		<layer id="108" name="247/InstanceNormalization/MVN" precision="FP32" type="MVN">
			<data across_channels="0" eps="9.999999747378752e-06" normalize_variance="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="247/InstanceNormalization/Mul/FusedScaleShift_" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
