<?xml version="1.0" ?>
<net batch="1" name="single-image-super-resolution-0063" version="4">
	<layers>
		<layer id="0" name="0" precision="FP16" type="Input">
			<output>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="112" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="9,9" output="32" pads_begin="4,4" pads_end="4,4" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
			<blobs>
				<weights offset="0" size="15552"/>
			</blobs>
		</layer>
		<layer id="2" name="113" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="114" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
			<blobs>
				<weights offset="15552" size="18432"/>
			</blobs>
		</layer>
		<layer id="4" name="117/InstanceNormalization/MVN" precision="FP16" type="MVN">
			<data across_channels="0" eps="9.999999747378752e-06" normalize_variance="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="117/InstanceNormalization/Mul/FusedScaleShift_" precision="FP16" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
			<blobs>
				<weights offset="33984" size="64"/>
				<biases offset="34048" size="64"/>
			</blobs>
		</layer>
		<layer id="6" name="118" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="119" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
			<blobs>
				<weights offset="34112" size="18432"/>
			</blobs>
		</layer>
		<layer id="8" name="122/InstanceNormalization/MVN" precision="FP16" type="MVN">
			<data across_channels="0" eps="9.999999747378752e-06" normalize_variance="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="122/InstanceNormalization/Mul/FusedScaleShift_" precision="FP16" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
			<blobs>
				<weights offset="52544" size="64"/>
				<biases offset="52608" size="64"/>
			</blobs>
		</layer>
		<layer id="10" name="123" precision="FP16" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="124" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
			<blobs>
				<weights offset="52672" size="18432"/>
			</blobs>
		</layer>
		<layer id="12" name="127/InstanceNormalization/MVN" precision="FP16" type="MVN">
			<data across_channels="0" eps="9.999999747378752e-06" normalize_variance="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="127/InstanceNormalization/Mul/FusedScaleShift_" precision="FP16" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
			<blobs>
				<weights offset="71104" size="64"/>
				<biases offset="71168" size="64"/>
			</blobs>
		</layer>
		<layer id="14" name="128" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="129" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
			<blobs>
				<weights offset="71232" size="18432"/>
			</blobs>
		</layer>
		<layer id="16" name="132/InstanceNormalization/MVN" precision="FP16" type="MVN">
			<data across_channels="0" eps="9.999999747378752e-06" normalize_variance="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="132/InstanceNormalization/Mul/FusedScaleShift_" precision="FP16" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
			<blobs>
				<weights offset="89664" size="64"/>
				<biases offset="89728" size="64"/>
			</blobs>
		</layer>
		<layer id="18" name="133" precision="FP16" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="134" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
			<blobs>
				<weights offset="89792" size="18432"/>
			</blobs>
		</layer>
		<layer id="20" name="137/InstanceNormalization/MVN" precision="FP16" type="MVN">
			<data across_channels="0" eps="9.999999747378752e-06" normalize_variance="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="137/InstanceNormalization/Mul/FusedScaleShift_" precision="FP16" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
			<blobs>
				<weights offset="108224" size="64"/>
				<biases offset="108288" size="64"/>
			</blobs>
		</layer>
		<layer id="22" name="138" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="139" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
			<blobs>
				<weights offset="108352" size="18432"/>
			</blobs>
		</layer>
		<layer id="24" name="142/InstanceNormalization/MVN" precision="FP16" type="MVN">
			<data across_channels="0" eps="9.999999747378752e-06" normalize_variance="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="142/InstanceNormalization/Mul/FusedScaleShift_" precision="FP16" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
			<blobs>
				<weights offset="126784" size="64"/>
				<biases offset="126848" size="64"/>
			</blobs>
		</layer>
		<layer id="26" name="143" precision="FP16" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="144" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
			<blobs>
				<weights offset="126912" size="18432"/>
			</blobs>
		</layer>
		<layer id="28" name="147/InstanceNormalization/MVN" precision="FP16" type="MVN">
			<data across_channels="0" eps="9.999999747378752e-06" normalize_variance="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="147/InstanceNormalization/Mul/FusedScaleShift_" precision="FP16" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
			<blobs>
				<weights offset="145344" size="64"/>
				<biases offset="145408" size="64"/>
			</blobs>
		</layer>
		<layer id="30" name="148" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="149" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
			<blobs>
				<weights offset="145472" size="18432"/>
			</blobs>
		</layer>
		<layer id="32" name="152/InstanceNormalization/MVN" precision="FP16" type="MVN">
			<data across_channels="0" eps="9.999999747378752e-06" normalize_variance="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="152/InstanceNormalization/Mul/FusedScaleShift_" precision="FP16" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
			<blobs>
				<weights offset="163904" size="64"/>
				<biases offset="163968" size="64"/>
			</blobs>
		</layer>
		<layer id="34" name="153" precision="FP16" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="154" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
			<blobs>
				<weights offset="164032" size="18432"/>
			</blobs>
		</layer>
		<layer id="36" name="157/InstanceNormalization/MVN" precision="FP16" type="MVN">
			<data across_channels="0" eps="9.999999747378752e-06" normalize_variance="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="157/InstanceNormalization/Mul/FusedScaleShift_" precision="FP16" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
			<blobs>
				<weights offset="182464" size="64"/>
				<biases offset="182528" size="64"/>
			</blobs>
		</layer>
		<layer id="38" name="158" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="159" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
			<blobs>
				<weights offset="182592" size="18432"/>
			</blobs>
		</layer>
		<layer id="40" name="162/InstanceNormalization/MVN" precision="FP16" type="MVN">
			<data across_channels="0" eps="9.999999747378752e-06" normalize_variance="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="162/InstanceNormalization/Mul/FusedScaleShift_" precision="FP16" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
			<blobs>
				<weights offset="201024" size="64"/>
				<biases offset="201088" size="64"/>
			</blobs>
		</layer>
		<layer id="42" name="163" precision="FP16" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="164" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
			<blobs>
				<weights offset="201152" size="18432"/>
			</blobs>
		</layer>
		<layer id="44" name="167/InstanceNormalization/MVN" precision="FP16" type="MVN">
			<data across_channels="0" eps="9.999999747378752e-06" normalize_variance="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="167/InstanceNormalization/Mul/FusedScaleShift_" precision="FP16" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
			<blobs>
				<weights offset="219584" size="64"/>
				<biases offset="219648" size="64"/>
			</blobs>
		</layer>
		<layer id="46" name="168" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="169" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
			<blobs>
				<weights offset="219712" size="18432"/>
			</blobs>
		</layer>
		<layer id="48" name="172/InstanceNormalization/MVN" precision="FP16" type="MVN">
			<data across_channels="0" eps="9.999999747378752e-06" normalize_variance="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="172/InstanceNormalization/Mul/FusedScaleShift_" precision="FP16" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
			<blobs>
				<weights offset="238144" size="64"/>
				<biases offset="238208" size="64"/>
			</blobs>
		</layer>
		<layer id="50" name="173" precision="FP16" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="174" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
			<blobs>
				<weights offset="238272" size="18432"/>
			</blobs>
		</layer>
		<layer id="52" name="177/InstanceNormalization/MVN" precision="FP16" type="MVN">
			<data across_channels="0" eps="9.999999747378752e-06" normalize_variance="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="177/InstanceNormalization/Mul/FusedScaleShift_" precision="FP16" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
			<blobs>
				<weights offset="256704" size="64"/>
				<biases offset="256768" size="64"/>
			</blobs>
		</layer>
		<layer id="54" name="178" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="179" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
			<blobs>
				<weights offset="256832" size="18432"/>
			</blobs>
		</layer>
		<layer id="56" name="182/InstanceNormalization/MVN" precision="FP16" type="MVN">
			<data across_channels="0" eps="9.999999747378752e-06" normalize_variance="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="182/InstanceNormalization/Mul/FusedScaleShift_" precision="FP16" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
			<blobs>
				<weights offset="275264" size="64"/>
				<biases offset="275328" size="64"/>
			</blobs>
		</layer>
		<layer id="58" name="183" precision="FP16" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="184" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
			<blobs>
				<weights offset="275392" size="18432"/>
			</blobs>
		</layer>
		<layer id="60" name="187/InstanceNormalization/MVN" precision="FP16" type="MVN">
			<data across_channels="0" eps="9.999999747378752e-06" normalize_variance="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="187/InstanceNormalization/Mul/FusedScaleShift_" precision="FP16" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
			<blobs>
				<weights offset="293824" size="64"/>
				<biases offset="293888" size="64"/>
			</blobs>
		</layer>
		<layer id="62" name="188" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="189" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
			<blobs>
				<weights offset="293952" size="18432"/>
			</blobs>
		</layer>
		<layer id="64" name="192/InstanceNormalization/MVN" precision="FP16" type="MVN">
			<data across_channels="0" eps="9.999999747378752e-06" normalize_variance="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="192/InstanceNormalization/Mul/FusedScaleShift_" precision="FP16" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
			<blobs>
				<weights offset="312384" size="64"/>
				<biases offset="312448" size="64"/>
			</blobs>
		</layer>
		<layer id="66" name="193" precision="FP16" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="194" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
			<blobs>
				<weights offset="312512" size="18432"/>
			</blobs>
		</layer>
		<layer id="68" name="197/InstanceNormalization/MVN" precision="FP16" type="MVN">
			<data across_channels="0" eps="9.999999747378752e-06" normalize_variance="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="197/InstanceNormalization/Mul/FusedScaleShift_" precision="FP16" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
			<blobs>
				<weights offset="330944" size="64"/>
				<biases offset="331008" size="64"/>
			</blobs>
		</layer>
		<layer id="70" name="198" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="199" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
			<blobs>
				<weights offset="331072" size="18432"/>
			</blobs>
		</layer>
		<layer id="72" name="202/InstanceNormalization/MVN" precision="FP16" type="MVN">
			<data across_channels="0" eps="9.999999747378752e-06" normalize_variance="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="202/InstanceNormalization/Mul/FusedScaleShift_" precision="FP16" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
			<blobs>
				<weights offset="349504" size="64"/>
				<biases offset="349568" size="64"/>
			</blobs>
		</layer>
		<layer id="74" name="203" precision="FP16" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="204" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
			<blobs>
				<weights offset="349632" size="18432"/>
			</blobs>
		</layer>
		<layer id="76" name="207/InstanceNormalization/MVN" precision="FP16" type="MVN">
			<data across_channels="0" eps="9.999999747378752e-06" normalize_variance="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="207/InstanceNormalization/Mul/FusedScaleShift_" precision="FP16" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
			<blobs>
				<weights offset="368064" size="64"/>
				<biases offset="368128" size="64"/>
			</blobs>
		</layer>
		<layer id="78" name="208" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="209" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
			<blobs>
				<weights offset="368192" size="18432"/>
			</blobs>
		</layer>
		<layer id="80" name="212/InstanceNormalization/MVN" precision="FP16" type="MVN">
			<data across_channels="0" eps="9.999999747378752e-06" normalize_variance="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="212/InstanceNormalization/Mul/FusedScaleShift_" precision="FP16" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
			<blobs>
				<weights offset="386624" size="64"/>
				<biases offset="386688" size="64"/>
			</blobs>
		</layer>
		<layer id="82" name="213" precision="FP16" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="214" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
			<blobs>
				<weights offset="386752" size="18432"/>
			</blobs>
		</layer>
		<layer id="84" name="217/InstanceNormalization/MVN" precision="FP16" type="MVN">
			<data across_channels="0" eps="9.999999747378752e-06" normalize_variance="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="217/InstanceNormalization/Mul/FusedScaleShift_" precision="FP16" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
			<blobs>
				<weights offset="405184" size="64"/>
				<biases offset="405248" size="64"/>
			</blobs>
		</layer>
		<layer id="86" name="218" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="219" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
			<blobs>
				<weights offset="405312" size="18432"/>
			</blobs>
		</layer>
		<layer id="88" name="222/InstanceNormalization/MVN" precision="FP16" type="MVN">
			<data across_channels="0" eps="9.999999747378752e-06" normalize_variance="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="222/InstanceNormalization/Mul/FusedScaleShift_" precision="FP16" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
			<blobs>
				<weights offset="423744" size="64"/>
				<biases offset="423808" size="64"/>
			</blobs>
		</layer>
		<layer id="90" name="223" precision="FP16" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="224" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
			<blobs>
				<weights offset="423872" size="18432"/>
			</blobs>
		</layer>
		<layer id="92" name="227/InstanceNormalization/MVN" precision="FP16" type="MVN">
			<data across_channels="0" eps="9.999999747378752e-06" normalize_variance="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="227/InstanceNormalization/Mul/FusedScaleShift_" precision="FP16" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
			<blobs>
				<weights offset="442304" size="64"/>
				<biases offset="442368" size="64"/>
			</blobs>
		</layer>
		<layer id="94" name="228" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="229" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
			<blobs>
				<weights offset="442432" size="18432"/>
			</blobs>
		</layer>
		<layer id="96" name="232/InstanceNormalization/MVN" precision="FP16" type="MVN">
			<data across_channels="0" eps="9.999999747378752e-06" normalize_variance="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="232/InstanceNormalization/Mul/FusedScaleShift_" precision="FP16" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
			<blobs>
				<weights offset="460864" size="64"/>
				<biases offset="460928" size="64"/>
			</blobs>
		</layer>
		<layer id="98" name="233" precision="FP16" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="234" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
			<blobs>
				<weights offset="460992" size="18432"/>
			</blobs>
		</layer>
		<layer id="100" name="237/InstanceNormalization/MVN" precision="FP16" type="MVN">
			<data across_channels="0" eps="9.999999747378752e-06" normalize_variance="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="237/InstanceNormalization/Mul/FusedScaleShift_" precision="FP16" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
			<blobs>
				<weights offset="479424" size="64"/>
				<biases offset="479488" size="64"/>
			</blobs>
		</layer>
		<layer id="102" name="238" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="239" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
			<blobs>
				<weights offset="479552" size="18432"/>
			</blobs>
		</layer>
		<layer id="104" name="242/InstanceNormalization/MVN" precision="FP16" type="MVN">
			<data across_channels="0" eps="9.999999747378752e-06" normalize_variance="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="242/InstanceNormalization/Mul/FusedScaleShift_" precision="FP16" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
			<blobs>
				<weights offset="497984" size="64"/>
				<biases offset="498048" size="64"/>
			</blobs>
		</layer>
		<layer id="106" name="243" precision="FP16" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="244" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
			<blobs>
				<weights offset="498112" size="18432"/>
			</blobs>
		</layer>
		<layer id="108" name="247/InstanceNormalization/MVN" precision="FP16" type="MVN">
			<data across_channels="0" eps="9.999999747378752e-06" normalize_variance="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="247/InstanceNormalization/Mul/FusedScaleShift_" precision="FP16" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>200</dim>
				</port>
