<net name="cnn_fd_004_sq_light_ssd" version="2" batch="1">
    <layers>
        <layer name="data" type="Input" precision="FP32" id="0">
            <output>
                <port id="0">
                    <dim>1</dim>
                    <dim>3</dim>
                    <dim>300</dim>
                    <dim>300</dim>
                </port>
            </output>
        </layer>
        <layer name="Scale1" type="ScaleShift" precision="FP32" id="2">
            <input>
                <port id="2">
                    <dim>1</dim>
                    <dim>3</dim>
                    <dim>300</dim>
                    <dim>300</dim>
                </port>
            </input>
            <output>
                <port id="3">
                    <dim>1</dim>
                    <dim>3</dim>
                    <dim>300</dim>
                    <dim>300</dim>
                </port>
            </output>
            <weights offset="0" size="12"/>
            <biases offset="12" size="12"/>
        </layer>
        <layer name="Convolution1" type="Convolution" precision="FP32" id="3">
            <convolution_data stride-x="2" stride-y="2" pad-x="3" pad-y="3" kernel-x="7" kernel-y="7" output="32" group="1"/>
            <input>
                <port id="4">
                    <dim>1</dim>
                    <dim>3</dim>
                    <dim>300</dim>
                    <dim>300</dim>
                </port>
            </input>
            <output>
                <port id="5">
                    <dim>1</dim>
                    <dim>32</dim>
                    <dim>150</dim>
                    <dim>150</dim>
                </port>
            </output>
            <weights offset="24" size="18816"/>
            <biases offset="18840" size="128"/>
        </layer>
        <layer name="ReLU1" type="ReLU" precision="FP32" id="4">
            <data negative_slope="0" engine="caffe.ReLUParameter.DEFAULT"/>
            <input>
                <port id="6">
                    <dim>1</dim>
                    <dim>32</dim>
                    <dim>150</dim>
                    <dim>150</dim>
                </port>
            </input>
            <output>
                <port id="7">
                    <dim>1</dim>
                    <dim>32</dim>
                    <dim>150</dim>
                    <dim>150</dim>
                </port>
            </output>
        </layer>
        <layer name="Pooling1" type="Pooling" precision="FP32" id="5">
            <pooling_data kernel-x="3" kernel-y="3" pad-x="0" pad-y="0" stride-x="2" stride-y="2" rounding-type="ceil" pool-method="max"/>
            <input>
                <port id="8">
                    <dim>1</dim>
                    <dim>32</dim>
                    <dim>150</dim>
                    <dim>150</dim>
                </port>
            </input>
            <output>
                <port id="9">
                    <dim>1</dim>
                    <dim>32</dim>
                    <dim>75</dim>
                    <dim>75</dim>
                </port>
            </output>
        </layer>
        <layer name="fire2_squeeze1x1" type="Convolution" precision="FP32" id="6">
            <convolution_data stride-x="1" stride-y="1" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="8" group="1"/>
            <input>
                <port id="10">
                    <dim>1</dim>
                    <dim>32</dim>
                    <dim>75</dim>
                    <dim>75</dim>
                </port>
            </input>
            <output>
                <port id="11">
                    <dim>1</dim>
                    <dim>8</dim>
                    <dim>75</dim>
                    <dim>75</dim>
                </port>
            </output>
            <weights offset="18968" size="1024"/>
            <biases offset="19992" size="32"/>
        </layer>
        <layer name="fire2_relu_squeeze1x1" type="ReLU" precision="FP32" id="7">
            <data negative_slope="0" engine="caffe.ReLUParameter.DEFAULT"/>
            <input>
                <port id="12">
                    <dim>1</dim>
                    <dim>8</dim>
                    <dim>75</dim>
                    <dim>75</dim>
                </port>
            </input>
            <output>
                <port id="13">
                    <dim>1</dim>
                    <dim>8</dim>
                    <dim>75</dim>
                    <dim>75</dim>
                </port>
            </output>
        </layer>
        <layer name="fire2_expand3x3" type="Convolution" precision="FP32" id="10">
            <convolution_data stride-x="1" stride-y="1" pad-x="1" pad-y="1" kernel-x="3" kernel-y="3" output="32" group="1"/>
            <input>
                <port id="18">
                    <dim>1</dim>
                    <dim>8</dim>
                    <dim>75</dim>
                    <dim>75</dim>
                </port>
            </input>
            <output>
                <port id="19">
                    <dim>1</dim>
                    <dim>32</dim>
                    <dim>75</dim>
                    <dim>75</dim>
                </port>
            </output>
            <weights offset="20024" size="9216"/>
            <biases offset="29240" size="128"/>
        </layer>
        <layer name="fire2_relu_expand3x3" type="ReLU" precision="FP32" id="11">
            <data negative_slope="0" engine="caffe.ReLUParameter.DEFAULT"/>
            <input>
                <port id="20">
                    <dim>1</dim>
                    <dim>32</dim>
                    <dim>75</dim>
                    <dim>75</dim>
                </port>
            </input>
            <output>
                <port id="21">
                    <dim>1</dim>
                    <dim>32</dim>
                    <dim>75</dim>
                    <dim>75</dim>
                </port>
            </output>
        </layer>
        <layer name="fire2_expand1x1" type="Convolution" precision="FP32" id="8">
            <convolution_data stride-x="1" stride-y="1" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="32" group="1"/>
            <input>
                <port id="14">
                    <dim>1</dim>
                    <dim>8</dim>
                    <dim>75</dim>
                    <dim>75</dim>
                </port>
            </input>
            <output>
                <port id="15">
                    <dim>1</dim>
                    <dim>32</dim>
                    <dim>75</dim>
                    <dim>75</dim>
                </port>
            </output>
            <weights offset="29368" size="1024"/>
            <biases offset="30392" size="128"/>
        </layer>
        <layer name="fire2_relu_expand1x1" type="ReLU" precision="FP32" id="9">
            <data negative_slope="0" engine="caffe.ReLUParameter.DEFAULT"/>
            <input>
                <port id="16">
                    <dim>1</dim>
                    <dim>32</dim>
                    <dim>75</dim>
                    <dim>75</dim>
                </port>
            </input>
            <output>
                <port id="17">
                    <dim>1</dim>
                    <dim>32</dim>
                    <dim>75</dim>
                    <dim>75</dim>
                </port>
            </output>
        </layer>
        <layer name="Concat1" type="Concat" precision="FP32" id="12">
            <concat_data axis="1"/>
            <input>
                <port id="22">
                    <dim>1</dim>
                    <dim>32</dim>
                    <dim>75</dim>
                    <dim>75</dim>
                </port>
                <port id="23">
                    <dim>1</dim>
                    <dim>32</dim>
                    <dim>75</dim>
                    <dim>75</dim>
                </port>
            </input>
            <output>
                <port id="24">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>75</dim>
                    <dim>75</dim>
                </port>
            </output>
        </layer>
        <layer name="fire3_squeeze1x1" type="Convolution" precision="FP32" id="13">
            <convolution_data stride-x="1" stride-y="1" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="8" group="1"/>
            <input>
                <port id="25">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>75</dim>
                    <dim>75</dim>
                </port>
            </input>
            <output>
                <port id="26">
                    <dim>1</dim>
                    <dim>8</dim>
                    <dim>75</dim>
                    <dim>75</dim>
                </port>
            </output>
            <weights offset="30520" size="2048"/>
            <biases offset="32568" size="32"/>
        </layer>
        <layer name="fire3_relu_squeeze1x1" type="ReLU" precision="FP32" id="14">
            <data negative_slope="0" engine="caffe.ReLUParameter.DEFAULT"/>
            <input>
                <port id="27">
                    <dim>1</dim>
                    <dim>8</dim>
                    <dim>75</dim>
                    <dim>75</dim>
                </port>
            </input>
            <output>
                <port id="28">
                    <dim>1</dim>
                    <dim>8</dim>
                    <dim>75</dim>
                    <dim>75</dim>
                </port>
            </output>
        </layer>
        <layer name="fire3_expand3x3" type="Convolution" precision="FP32" id="17">
            <convolution_data stride-x="1" stride-y="1" pad-x="1" pad-y="1" kernel-x="3" kernel-y="3" output="32" group="1"/>
            <input>
                <port id="33">
                    <dim>1</dim>
                    <dim>8</dim>
                    <dim>75</dim>
                    <dim>75</dim>
                </port>
            </input>
            <output>
                <port id="34">
                    <dim>1</dim>
                    <dim>32</dim>
                    <dim>75</dim>
                    <dim>75</dim>
                </port>
            </output>
            <weights offset="32600" size="9216"/>
            <biases offset="41816" size="128"/>
        </layer>
        <layer name="fire3_relu_expand3x3" type="ReLU" precision="FP32" id="18">
            <data negative_slope="0" engine="caffe.ReLUParameter.DEFAULT"/>
            <input>
                <port id="35">
                    <dim>1</dim>
                    <dim>32</dim>
                    <dim>75</dim>
                    <dim>75</dim>
                </port>
            </input>
            <output>
                <port id="36">
                    <dim>1</dim>
                    <dim>32</dim>
                    <dim>75</dim>
                    <dim>75</dim>
                </port>
            </output>
        </layer>
        <layer name="fire3_expand1x1" type="Convolution" precision="FP32" id="15">
            <convolution_data stride-x="1" stride-y="1" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="32" group="1"/>
            <input>
                <port id="29">
                    <dim>1</dim>
                    <dim>8</dim>
                    <dim>75</dim>
                    <dim>75</dim>
                </port>
            </input>
            <output>
                <port id="30">
                    <dim>1</dim>
                    <dim>32</dim>
                    <dim>75</dim>
                    <dim>75</dim>
                </port>
            </output>
            <weights offset="41944" size="1024"/>
            <biases offset="42968" size="128"/>
        </layer>
        <layer name="fire3_relu_expand1x1" type="ReLU" precision="FP32" id="16">
            <data negative_slope="0" engine="caffe.ReLUParameter.DEFAULT"/>
            <input>
                <port id="31">
                    <dim>1</dim>
                    <dim>32</dim>
                    <dim>75</dim>
                    <dim>75</dim>
                </port>
            </input>
            <output>
                <port id="32">
                    <dim>1</dim>
                    <dim>32</dim>
                    <dim>75</dim>
                    <dim>75</dim>
                </port>
            </output>
        </layer>
        <layer name="Concat2" type="Concat" precision="FP32" id="19">
            <concat_data axis="1"/>
            <input>
                <port id="37">
                    <dim>1</dim>
                    <dim>32</dim>
                    <dim>75</dim>
                    <dim>75</dim>
                </port>
                <port id="38">
                    <dim>1</dim>
                    <dim>32</dim>
                    <dim>75</dim>
                    <dim>75</dim>
                </port>
            </input>
            <output>
                <port id="39">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>75</dim>
                    <dim>75</dim>
                </port>
            </output>
        </layer>
        <layer name="fire4_squeeze1x1" type="Convolution" precision="FP32" id="20">
            <convolution_data stride-x="1" stride-y="1" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="16" group="1"/>
            <input>
                <port id="40">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>75</dim>
                    <dim>75</dim>
                </port>
            </input>
            <output>
                <port id="41">
                    <dim>1</dim>
                    <dim>16</dim>
                    <dim>75</dim>
                    <dim>75</dim>
                </port>
            </output>
            <weights offset="43096" size="4096"/>
            <biases offset="47192" size="64"/>
        </layer>
        <layer name="fire4_relu_squeeze1x1" type="ReLU" precision="FP32" id="21">
            <data negative_slope="0" engine="caffe.ReLUParameter.DEFAULT"/>
            <input>
                <port id="42">
                    <dim>1</dim>
                    <dim>16</dim>
                    <dim>75</dim>
                    <dim>75</dim>
                </port>
            </input>
            <output>
                <port id="43">
                    <dim>1</dim>
                    <dim>16</dim>
                    <dim>75</dim>
                    <dim>75</dim>
                </port>
            </output>
        </layer>
        <layer name="fire4_expand3x3" type="Convolution" precision="FP32" id="24">
            <convolution_data stride-x="1" stride-y="1" pad-x="1" pad-y="1" kernel-x="3" kernel-y="3" output="64" group="1"/>
            <input>
                <port id="48">
                    <dim>1</dim>
                    <dim>16</dim>
                    <dim>75</dim>
                    <dim>75</dim>
                </port>
            </input>
            <output>
                <port id="49">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>75</dim>
                    <dim>75</dim>
                </port>
            </output>
            <weights offset="47256" size="36864"/>
            <biases offset="84120" size="256"/>
        </layer>
        <layer name="fire4_relu_expand3x3" type="ReLU" precision="FP32" id="25">
            <data negative_slope="0" engine="caffe.ReLUParameter.DEFAULT"/>
            <input>
                <port id="50">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>75</dim>
                    <dim>75</dim>
                </port>
            </input>
            <output>
                <port id="51">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>75</dim>
                    <dim>75</dim>
                </port>
            </output>
        </layer>
        <layer name="fire4_expand1x1" type="Convolution" precision="FP32" id="22">
            <convolution_data stride-x="1" stride-y="1" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="64" group="1"/>
            <input>
                <port id="44">
                    <dim>1</dim>
                    <dim>16</dim>
                    <dim>75</dim>
                    <dim>75</dim>
                </port>
            </input>
            <output>
                <port id="45">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>75</dim>
                    <dim>75</dim>
                </port>
            </output>
            <weights offset="84376" size="4096"/>
            <biases offset="88472" size="256"/>
        </layer>
        <layer name="fire4_relu_expand1x1" type="ReLU" precision="FP32" id="23">
            <data negative_slope="0" engine="caffe.ReLUParameter.DEFAULT"/>
            <input>
                <port id="46">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>75</dim>
                    <dim>75</dim>
                </port>
            </input>
            <output>
                <port id="47">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>75</dim>
                    <dim>75</dim>
                </port>
            </output>
        </layer>
        <layer name="Concat3" type="Concat" precision="FP32" id="26">
            <concat_data axis="1"/>
            <input>
                <port id="52">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>75</dim>
                    <dim>75</dim>
                </port>
                <port id="53">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>75</dim>
                    <dim>75</dim>
                </port>
            </input>
            <output>
                <port id="54">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>75</dim>
                    <dim>75</dim>
                </port>
            </output>
        </layer>
        <layer name="fire5_squeeze1x1" type="Convolution" precision="FP32" id="27">
            <convolution_data stride-x="2" stride-y="2" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="16" group="1"/>
            <input>
                <port id="55">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>75</dim>
                    <dim>75</dim>
                </port>
            </input>
            <output>
                <port id="56">
                    <dim>1</dim>
                    <dim>16</dim>
                    <dim>38</dim>
                    <dim>38</dim>
                </port>
            </output>
            <weights offset="88728" size="8192"/>
            <biases offset="96920" size="64"/>
        </layer>
        <layer name="fire5_relu_squeeze1x1" type="ReLU" precision="FP32" id="28">
            <data negative_slope="0" engine="caffe.ReLUParameter.DEFAULT"/>
            <input>
                <port id="57">
                    <dim>1</dim>
                    <dim>16</dim>
                    <dim>38</dim>
                    <dim>38</dim>
                </port>
            </input>
            <output>
                <port id="58">
                    <dim>1</dim>
                    <dim>16</dim>
                    <dim>38</dim>
                    <dim>38</dim>
                </port>
            </output>
        </layer>
        <layer name="fire5_expand3x3" type="Convolution" precision="FP32" id="31">
            <convolution_data stride-x="1" stride-y="1" pad-x="1" pad-y="1" kernel-x="3" kernel-y="3" output="64" group="1"/>
            <input>
                <port id="63">
                    <dim>1</dim>
                    <dim>16</dim>
                    <dim>38</dim>
                    <dim>38</dim>
                </port>
            </input>
            <output>
                <port id="64">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>38</dim>
                    <dim>38</dim>
                </port>
            </output>
            <weights offset="96984" size="36864"/>
            <biases offset="133848" size="256"/>
        </layer>
        <layer name="fire5_relu_expand3x3" type="ReLU" precision="FP32" id="32">
            <data negative_slope="0" engine="caffe.ReLUParameter.DEFAULT"/>
            <input>
                <port id="65">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>38</dim>
                    <dim>38</dim>
                </port>
            </input>
            <output>
                <port id="66">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>38</dim>
                    <dim>38</dim>
                </port>
            </output>
        </layer>
        <layer name="fire5_expand1x1" type="Convolution" precision="FP32" id="29">
            <convolution_data stride-x="1" stride-y="1" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="64" group="1"/>
            <input>
                <port id="59">
                    <dim>1</dim>
                    <dim>16</dim>
                    <dim>38</dim>
                    <dim>38</dim>
                </port>
            </input>
            <output>
                <port id="60">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>38</dim>
                    <dim>38</dim>
                </port>
            </output>
            <weights offset="134104" size="4096"/>
            <biases offset="138200" size="256"/>
        </layer>
        <layer name="fire5_relu_expand1x1" type="ReLU" precision="FP32" id="30">
            <data negative_slope="0" engine="caffe.ReLUParameter.DEFAULT"/>
            <input>
                <port id="61">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>38</dim>
                    <dim>38</dim>
                </port>
            </input>
            <output>
                <port id="62">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>38</dim>
                    <dim>38</dim>
                </port>
            </output>
        </layer>
        <layer name="Concat4" type="Concat" precision="FP32" id="33">
            <concat_data axis="1"/>
            <input>
                <port id="67">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>38</dim>
                    <dim>38</dim>
                </port>
                <port id="68">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>38</dim>
                    <dim>38</dim>
                </port>
            </input>
            <output>
                <port id="69">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>38</dim>
                    <dim>38</dim>
                </port>
            </output>
        </layer>
        <layer name="fire6_squeeze1x1" type="Convolution" precision="FP32" id="34">
            <convolution_data stride-x="1" stride-y="1" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="24" group="1"/>
            <input>
                <port id="70">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>38</dim>
                    <dim>38</dim>
                </port>
            </input>
            <output>
                <port id="71">
                    <dim>1</dim>
                    <dim>24</dim>
                    <dim>38</dim>
                    <dim>38</dim>
                </port>
            </output>
            <weights offset="138456" size="12288"/>
            <biases offset="150744" size="96"/>
        </layer>
        <layer name="fire6_relu_squeeze1x1" type="ReLU" precision="FP32" id="35">
            <data negative_slope="0" engine="caffe.ReLUParameter.DEFAULT"/>
            <input>
                <port id="72">
                    <dim>1</dim>
                    <dim>24</dim>
                    <dim>38</dim>
                    <dim>38</dim>
                </port>
            </input>
            <output>
                <port id="73">
                    <dim>1</dim>
                    <dim>24</dim>
                    <dim>38</dim>
                    <dim>38</dim>
                </port>
            </output>
        </layer>
        <layer name="fire6_expand3x3" type="Convolution" precision="FP32" id="38">
            <convolution_data stride-x="1" stride-y="1" pad-x="1" pad-y="1" kernel-x="3" kernel-y="3" output="96" group="1"/>
            <input>
                <port id="78">
                    <dim>1</dim>
                    <dim>24</dim>
                    <dim>38</dim>
                    <dim>38</dim>
                </port>
            </input>
            <output>
                <port id="79">
                    <dim>1</dim>
                    <dim>96</dim>
                    <dim>38</dim>
                    <dim>38</dim>
                </port>
            </output>
            <weights offset="150840" size="82944"/>
            <biases offset="233784" size="384"/>
        </layer>
        <layer name="fire6_relu_expand3x3" type="ReLU" precision="FP32" id="39">
            <data negative_slope="0" engine="caffe.ReLUParameter.DEFAULT"/>
            <input>
                <port id="80">
                    <dim>1</dim>
                    <dim>96</dim>
                    <dim>38</dim>
                    <dim>38</dim>
                </port>
            </input>
            <output>
                <port id="81">
                    <dim>1</dim>
                    <dim>96</dim>
                    <dim>38</dim>
                    <dim>38</dim>
                </port>
            </output>
        </layer>
        <layer name="fire6_expand1x1" type="Convolution" precision="FP32" id="36">
            <convolution_data stride-x="1" stride-y="1" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="96" group="1"/>
            <input>
                <port id="74">
                    <dim>1</dim>
                    <dim>24</dim>
                    <dim>38</dim>
                    <dim>38</dim>
                </port>
            </input>
            <output>
                <port id="75">
                    <dim>1</dim>
                    <dim>96</dim>
                    <dim>38</dim>
                    <dim>38</dim>
                </port>
            </output>
            <weights offset="234168" size="9216"/>
            <biases offset="243384" size="384"/>
        </layer>
        <layer name="fire6_relu_expand1x1" type="ReLU" precision="FP32" id="37">
            <data negative_slope="0" engine="caffe.ReLUParameter.DEFAULT"/>
            <input>
                <port id="76">
                    <dim>1</dim>
                    <dim>96</dim>
                    <dim>38</dim>
                    <dim>38</dim>
                </port>
            </input>
            <output>
                <port id="77">
                    <dim>1</dim>
                    <dim>96</dim>
                    <dim>38</dim>
                    <dim>38</dim>
                </port>
            </output>
        </layer>
        <layer name="Concat5" type="Concat" precision="FP32" id="40">
            <concat_data axis="1"/>
            <input>
                <port id="82">
                    <dim>1</dim>
                    <dim>96</dim>
                    <dim>38</dim>
                    <dim>38</dim>
                </port>
                <port id="83">
                    <dim>1</dim>
                    <dim>96</dim>
                    <dim>38</dim>
                    <dim>38</dim>
                </port>
            </input>
            <output>
                <port id="84">
                    <dim>1</dim>
                    <dim>192</dim>
                    <dim>38</dim>
                    <dim>38</dim>
                </port>
            </output>
        </layer>
        <layer name="fire7_squeeze1x1" type="Convolution" precision="FP32" id="41">
            <convolution_data stride-x="1" stride-y="1" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="24" group="1"/>
            <input>
                <port id="85">
                    <dim>1</dim>
                    <dim>192</dim>
                    <dim>38</dim>
                    <dim>38</dim>
                </port>
            </input>
            <output>
                <port id="86">
                    <dim>1</dim>
                    <dim>24</dim>
                    <dim>38</dim>
                    <dim>38</dim>
                </port>
            </output>
            <weights offset="243768" size="18432"/>
            <biases offset="262200" size="96"/>
        </layer>
        <layer name="fire7_relu_squeeze1x1" type="ReLU" precision="FP32" id="42">
            <data negative_slope="0" engine="caffe.ReLUParameter.DEFAULT"/>
            <input>
                <port id="87">
                    <dim>1</dim>
                    <dim>24</dim>
                    <dim>38</dim>
                    <dim>38</dim>
                </port>
            </input>
            <output>
                <port id="88">
                    <dim>1</dim>
                    <dim>24</dim>
                    <dim>38</dim>
                    <dim>38</dim>
                </port>
            </output>
        </layer>
        <layer name="fire7_expand3x3" type="Convolution" precision="FP32" id="45">
            <convolution_data stride-x="1" stride-y="1" pad-x="1" pad-y="1" kernel-x="3" kernel-y="3" output="96" group="1"/>
            <input>
                <port id="93">
                    <dim>1</dim>
                    <dim>24</dim>
                    <dim>38</dim>
                    <dim>38</dim>
                </port>
            </input>
            <output>
                <port id="94">
                    <dim>1</dim>
                    <dim>96</dim>
                    <dim>38</dim>
                    <dim>38</dim>
                </port>
            </output>
            <weights offset="262296" size="82944"/>
            <biases offset="345240" size="384"/>
        </layer>
        <layer name="fire7_relu_expand3x3" type="ReLU" precision="FP32" id="46">
            <data negative_slope="0" engine="caffe.ReLUParameter.DEFAULT"/>
            <input>
                <port id="95">
                    <dim>1</dim>
                    <dim>96</dim>
                    <dim>38</dim>
                    <dim>38</dim>
                </port>
            </input>
            <output>
                <port id="96">
                    <dim>1</dim>
                    <dim>96</dim>
                    <dim>38</dim>
                    <dim>38</dim>
                </port>
            </output>
        </layer>
        <layer name="fire7_expand1x1" type="Convolution" precision="FP32" id="43">
            <convolution_data stride-x="1" stride-y="1" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="96" group="1"/>
            <input>
                <port id="89">
                    <dim>1</dim>
                    <dim>24</dim>
                    <dim>38</dim>
                    <dim>38</dim>
                </port>
            </input>
            <output>
                <port id="90">
                    <dim>1</dim>
                    <dim>96</dim>
                    <dim>38</dim>
                    <dim>38</dim>
                </port>
            </output>
            <weights offset="345624" size="9216"/>
            <biases offset="354840" size="384"/>
        </layer>
        <layer name="fire7_relu_expand1x1" type="ReLU" precision="FP32" id="44">
            <data negative_slope="0" engine="caffe.ReLUParameter.DEFAULT"/>
            <input>
                <port id="91">
                    <dim>1</dim>
                    <dim>96</dim>
                    <dim>38</dim>
                    <dim>38</dim>
                </port>
            </input>
            <output>
                <port id="92">
                    <dim>1</dim>
                    <dim>96</dim>
                    <dim>38</dim>
                    <dim>38</dim>
                </port>
            </output>
        </layer>
        <layer name="Concat6" type="Concat" precision="FP32" id="47">
            <concat_data axis="1"/>
            <input>
                <port id="97">
                    <dim>1</dim>
                    <dim>96</dim>
                    <dim>38</dim>
                    <dim>38</dim>
                </port>
                <port id="98">
                    <dim>1</dim>
                    <dim>96</dim>
                    <dim>38</dim>
                    <dim>38</dim>
                </port>
            </input>
            <output>
                <port id="99">
                    <dim>1</dim>
                    <dim>192</dim>
                    <dim>38</dim>
                    <dim>38</dim>
                </port>
            </output>
        </layer>
        <layer name="fire8_squeeze1x1" type="Convolution" precision="FP32" id="48">
            <convolution_data stride-x="1" stride-y="1" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="32" group="1"/>
            <input>
                <port id="100">
                    <dim>1</dim>
                    <dim>192</dim>
                    <dim>38</dim>
                    <dim>38</dim>
                </port>
            </input>
            <output>
                <port id="101">
                    <dim>1</dim>
                    <dim>32</dim>
                    <dim>38</dim>
                    <dim>38</dim>
                </port>
            </output>
            <weights offset="355224" size="24576"/>
            <biases offset="379800" size="128"/>
        </layer>
        <layer name="fire8_relu_squeeze1x1" type="ReLU" precision="FP32" id="49">
            <data negative_slope="0" engine="caffe.ReLUParameter.DEFAULT"/>
            <input>
                <port id="102">
                    <dim>1</dim>
                    <dim>32</dim>
                    <dim>38</dim>
                    <dim>38</dim>
                </port>
            </input>
            <output>
                <port id="103">
                    <dim>1</dim>
                    <dim>32</dim>
                    <dim>38</dim>
                    <dim>38</dim>
                </port>
            </output>
        </layer>
        <layer name="fire8_expand3x3" type="Convolution" precision="FP32" id="52">
            <convolution_data stride-x="1" stride-y="1" pad-x="1" pad-y="1" kernel-x="3" kernel-y="3" output="128" group="1"/>
            <input>
                <port id="108">
                    <dim>1</dim>
                    <dim>32</dim>
                    <dim>38</dim>
                    <dim>38</dim>
                </port>
            </input>
            <output>
                <port id="109">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>38</dim>
                    <dim>38</dim>
                </port>
            </output>
            <weights offset="379928" size="147456"/>
            <biases offset="527384" size="512"/>
        </layer>
        <layer name="fire8_relu_expand3x3" type="ReLU" precision="FP32" id="53">
            <data negative_slope="0" engine="caffe.ReLUParameter.DEFAULT"/>
            <input>
                <port id="110">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>38</dim>
                    <dim>38</dim>
                </port>
            </input>
            <output>
                <port id="111">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>38</dim>
                    <dim>38</dim>
                </port>
            </output>
        </layer>
        <layer name="fire8_expand1x1" type="Convolution" precision="FP32" id="50">
            <convolution_data stride-x="1" stride-y="1" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="128" group="1"/>
            <input>
                <port id="104">
                    <dim>1</dim>
                    <dim>32</dim>
                    <dim>38</dim>
                    <dim>38</dim>
                </port>
            </input>
            <output>
                <port id="105">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>38</dim>
                    <dim>38</dim>
                </port>
            </output>
            <weights offset="527896" size="16384"/>
            <biases offset="544280" size="512"/>
        </layer>
        <layer name="fire8_relu_expand1x1" type="ReLU" precision="FP32" id="51">
            <data negative_slope="0" engine="caffe.ReLUParameter.DEFAULT"/>
            <input>
                <port id="106">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>38</dim>
                    <dim>38</dim>
                </port>
            </input>
            <output>
                <port id="107">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>38</dim>
                    <dim>38</dim>
                </port>
            </output>
        </layer>
        <layer name="Concat7" type="Concat" precision="FP32" id="54">
            <concat_data axis="1"/>
            <input>
                <port id="112">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>38</dim>
                    <dim>38</dim>
                </port>
                <port id="113">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>38</dim>
                    <dim>38</dim>
                </port>
            </input>
            <output>
                <port id="114">
                    <dim>1</dim>
                    <dim>256</dim>
                    <dim>38</dim>
                    <dim>38</dim>
                </port>
            </output>
        </layer>
        <layer name="fire9_squeeze1x1" type="Convolution" precision="FP32" id="55">
            <convolution_data stride-x="2" stride-y="2" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="32" group="1"/>
            <input>
                <port id="115">
                    <dim>1</dim>
                    <dim>256</dim>
                    <dim>38</dim>
                    <dim>38</dim>
                </port>
            </input>
            <output>
                <port id="116">
                    <dim>1</dim>
                    <dim>32</dim>
                    <dim>19</dim>
                    <dim>19</dim>
                </port>
            </output>
            <weights offset="544792" size="32768"/>
            <biases offset="577560" size="128"/>
        </layer>
        <layer name="fire9_relu_squeeze1x1" type="ReLU" precision="FP32" id="56">
            <data negative_slope="0" engine="caffe.ReLUParameter.DEFAULT"/>
            <input>
                <port id="117">
                    <dim>1</dim>
                    <dim>32</dim>
                    <dim>19</dim>
                    <dim>19</dim>
                </port>
            </input>
            <output>
                <port id="118">
                    <dim>1</dim>
                    <dim>32</dim>
                    <dim>19</dim>
                    <dim>19</dim>
                </port>
            </output>
        </layer>
        <layer name="fire9_expand3x3" type="Convolution" precision="FP32" id="59">
            <convolution_data stride-x="1" stride-y="1" pad-x="1" pad-y="1" kernel-x="3" kernel-y="3" output="128" group="1"/>
            <input>
                <port id="123">
                    <dim>1</dim>
                    <dim>32</dim>
                    <dim>19</dim>
                    <dim>19</dim>
                </port>
            </input>
            <output>
                <port id="124">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>19</dim>
                    <dim>19</dim>
                </port>
            </output>
            <weights offset="577688" size="147456"/>
            <biases offset="725144" size="512"/>
        </layer>
        <layer name="fire9_relu_expand3x3" type="ReLU" precision="FP32" id="60">
            <data negative_slope="0" engine="caffe.ReLUParameter.DEFAULT"/>
            <input>
                <port id="125">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>19</dim>
                    <dim>19</dim>
                </port>
            </input>
            <output>
                <port id="126">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>19</dim>
                    <dim>19</dim>
                </port>
            </output>
        </layer>
        <layer name="fire9_expand1x1" type="Convolution" precision="FP32" id="57">
            <convolution_data stride-x="1" stride-y="1" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="128" group="1"/>
            <input>
                <port id="119">
                    <dim>1</dim>
                    <dim>32</dim>
                    <dim>19</dim>
                    <dim>19</dim>
                </port>
            </input>
            <output>
                <port id="120">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>19</dim>
                    <dim>19</dim>
                </port>
            </output>
            <weights offset="725656" size="16384"/>
            <biases offset="742040" size="512"/>
        </layer>
        <layer name="fire9_relu_expand1x1" type="ReLU" precision="FP32" id="58">
            <data negative_slope="0" engine="caffe.ReLUParameter.DEFAULT"/>
            <input>
                <port id="121">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>19</dim>
                    <dim>19</dim>
                </port>
            </input>
            <output>
                <port id="122">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>19</dim>
                    <dim>19</dim>
                </port>
            </output>
        </layer>
        <layer name="Concat8" type="Concat" precision="FP32" id="61">
            <concat_data axis="1"/>
            <input>
                <port id="127">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>19</dim>
                    <dim>19</dim>
                </port>
                <port id="128">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>19</dim>
                    <dim>19</dim>
                </port>
            </input>
            <output>
                <port id="129">
                    <dim>1</dim>
                    <dim>256</dim>
                    <dim>19</dim>
                    <dim>19</dim>
                </port>
            </output>
        </layer>
        <layer name="fire10_squeeze1x1" type="Convolution" precision="FP32" id="62">
            <convolution_data stride-x="1" stride-y="1" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="48" group="1"/>
            <input>
                <port id="130">
                    <dim>1</dim>
                    <dim>256</dim>
                    <dim>19</dim>
                    <dim>19</dim>
                </port>
            </input>
            <output>
                <port id="131">
                    <dim>1</dim>
                    <dim>48</dim>
                    <dim>19</dim>
                    <dim>19</dim>
                </port>
            </output>
            <weights offset="742552" size="49152"/>
            <biases offset="791704" size="192"/>
        </layer>
        <layer name="fire10_relu_squeeze1x1" type="ReLU" precision="FP32" id="63">
            <data negative_slope="0" engine="caffe.ReLUParameter.DEFAULT"/>
            <input>
                <port id="132">
                    <dim>1</dim>
                    <dim>48</dim>
                    <dim>19</dim>
                    <dim>19</dim>
                </port>
            </input>
            <output>
                <port id="133">
                    <dim>1</dim>
                    <dim>48</dim>
                    <dim>19</dim>
                    <dim>19</dim>
                </port>
            </output>
        </layer>
        <layer name="fire10_expand3x3" type="Convolution" precision="FP32" id="66">
            <convolution_data stride-x="1" stride-y="1" pad-x="1" pad-y="1" kernel-x="3" kernel-y="3" output="192" group="1"/>
            <input>
                <port id="138">
                    <dim>1</dim>
                    <dim>48</dim>
                    <dim>19</dim>
                    <dim>19</dim>
                </port>
            </input>
            <output>
                <port id="139">
                    <dim>1</dim>
                    <dim>192</dim>
                    <dim>19</dim>
                    <dim>19</dim>
                </port>
            </output>
            <weights offset="791896" size="331776"/>
            <biases offset="1123672" size="768"/>
        </layer>
        <layer name="fire10_relu_expand3x3" type="ReLU" precision="FP32" id="67">
            <data negative_slope="0" engine="caffe.ReLUParameter.DEFAULT"/>
            <input>
                <port id="140">
                    <dim>1</dim>
                    <dim>192</dim>
                    <dim>19</dim>
                    <dim>19</dim>
                </port>
            </input>
            <output>
                <port id="141">
                    <dim>1</dim>
                    <dim>192</dim>
                    <dim>19</dim>
                    <dim>19</dim>
                </port>
            </output>
        </layer>
        <layer name="fire10_expand1x1" type="Convolution" precision="FP32" id="64">
            <convolution_data stride-x="1" stride-y="1" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="192" group="1"/>
            <input>
                <port id="134">
                    <dim>1</dim>
                    <dim>48</dim>
                    <dim>19</dim>
                    <dim>19</dim>
                </port>
            </input>
            <output>
                <port id="135">
                    <dim>1</dim>
                    <dim>192</dim>
                    <dim>19</dim>
                    <dim>19</dim>
                </port>
            </output>
            <weights offset="1124440" size="36864"/>
            <biases offset="1161304" size="768"/>
        </layer>
        <layer name="fire10_relu_expand1x1" type="ReLU" precision="FP32" id="65">
            <data negative_slope="0" engine="caffe.ReLUParameter.DEFAULT"/>
            <input>
                <port id="136">
                    <dim>1</dim>
                    <dim>192</dim>
                    <dim>19</dim>
                    <dim>19</dim>
                </port>
            </input>
            <output>
                <port id="137">
                    <dim>1</dim>
                    <dim>192</dim>
                    <dim>19</dim>
                    <dim>19</dim>
                </port>
            </output>
        </layer>
        <layer name="Concat9" type="Concat" precision="FP32" id="68">
            <concat_data axis="1"/>
            <input>
                <port id="142">
                    <dim>1</dim>
                    <dim>192</dim>
                    <dim>19</dim>
                    <dim>19</dim>
                </port>
                <port id="143">
                    <dim>1</dim>
                    <dim>192</dim>
                    <dim>19</dim>
                    <dim>19</dim>
                </port>
            </input>
            <output>
                <port id="144">
                    <dim>1</dim>
                    <dim>384</dim>
                    <dim>19</dim>
                    <dim>19</dim>
                </port>
            </output>
        </layer>
        <layer name="fire11_squeeze1x1" type="Convolution" precision="FP32" id="69">
            <convolution_data stride-x="1" stride-y="1" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="48" group="1"/>
            <input>
                <port id="145">
                    <dim>1</dim>
                    <dim>384</dim>
                    <dim>19</dim>
                    <dim>19</dim>
                </port>
            </input>
            <output>
                <port id="146">
                    <dim>1</dim>
                    <dim>48</dim>
                    <dim>19</dim>
                    <dim>19</dim>
                </port>
            </output>
            <weights offset="1162072" size="73728"/>
            <biases offset="1235800" size="192"/>
        </layer>
        <layer name="fire11_relu_squeeze1x1" type="ReLU" precision="FP32" id="70">
            <data negative_slope="0" engine="caffe.ReLUParameter.DEFAULT"/>
            <input>
                <port id="147">
                    <dim>1</dim>
                    <dim>48</dim>
                    <dim>19</dim>
                    <dim>19</dim>
                </port>
            </input>
            <output>
