<?xml version="1.0" ?>
<net batch="1" name="model" version="2">
	<layers>
		<layer id="49" name="data" precision="FP32" type="Input">
			<output>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>160</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="541" name="conv1_1/conv" precision="FP32" type="Convolution">
			<data dilation-x="1" dilation-y="1" group="1" kernel-x="7" kernel-y="7" output="16" pad-x="3" pad-y="3" stride="1,1,2,2" stride-x="2" stride-y="2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>160</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>16</dim>
					<dim>80</dim>
					<dim>40</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1331104" size="9408"/>
			</blobs>
		</layer>
		<layer id="76" name="conv1_1/bn" precision="FP32" type="BatchNormalization">
			<data epsilon="9.999999747378752e-06"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>80</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>16</dim>
					<dim>80</dim>
					<dim>40</dim>
				</port>
			</output>
			<blobs>
				<biases offset="2651808" size="64"/>
				<weights offset="3380352" size="64"/>
			</blobs>
		</layer>
		<layer id="329" name="conv1_1/neg" precision="FP32" type="Power">
			<data power="1.0" scale="-1.0" shift="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>80</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>80</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="203" name="conv1_1/concat" precision="FP32" type="Concat">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>80</dim>
					<dim>40</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>80</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="139" name="conv1_1/scale" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>40</dim>
				</port>
			</output>
			<blobs>
				<weights offset="4402624" size="128"/>
				<biases offset="875296" size="128"/>
			</blobs>
		</layer>
		<layer id="594" name="conv1_1/relu" precision="FP32" type="ReLU">
			<data engine="caffe.ReLUParameter.DEFAULT" negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="pool1" precision="FP32" type="Pooling">
			<data exclude-pad="false" kernel-x="3" kernel-y="3" pad-x="0" pad-y="0" pool-method="max" rounding_type="ceil" stride="1,1,2,2" stride-x="2" stride-y="2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>80</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="680" name="conv2_1/proj" precision="FP32" type="Convolution">
			<data dilation-x="1" dilation-y="1" group="1" kernel-x="1" kernel-y="1" output="64" pad-x="0" pad-y="0" stride="1,1,1,1" stride-x="1" stride-y="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2400" size="8192"/>
				<biases offset="2024928" size="256"/>
			</blobs>
		</layer>
		<layer id="68" name="conv2_1/1/conv" precision="FP32" type="Convolution">
			<data dilation-x="1" dilation-y="1" group="1" kernel-x="1" kernel-y="1" output="24" pad-x="0" pad-y="0" stride="1,1,1,1" stride-x="1" stride-y="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>24</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2353376" size="3072"/>
				<biases offset="2455904" size="96"/>
			</blobs>
		</layer>
		<layer id="212" name="conv2_1/2/bn" precision="FP32" type="BatchNormalization">
			<data epsilon="9.999999747378752e-06"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>24</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</output>
			<blobs>
				<biases offset="1340512" size="96"/>
				<weights offset="1125760" size="96"/>
			</blobs>
		</layer>
		<layer id="559" name="conv2_1/2/bn_scale" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>24</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1343040" size="96"/>
				<biases offset="2730080" size="96"/>
			</blobs>
		</layer>
		<layer id="565" name="conv2_1/2/relu" precision="FP32" type="ReLU">
			<data engine="caffe.ReLUParameter.DEFAULT" negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>24</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="conv2_1/2/conv" precision="FP32" type="Convolution">
			<data dilation-x="1" dilation-y="1" group="1" kernel-x="3" kernel-y="3" output="24" pad-x="1" pad-y="1" stride="1,1,1,1" stride-x="1" stride-y="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>24</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3380416" size="20736"/>
				<biases offset="2456000" size="96"/>
			</blobs>
		</layer>
		<layer id="353" name="conv2_1/3/bn" precision="FP32" type="BatchNormalization">
			<data epsilon="9.999999747378752e-06"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>24</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</output>
			<blobs>
				<biases offset="1406336" size="96"/>
				<weights offset="4381408" size="96"/>
			</blobs>
		</layer>
		<layer id="701" name="conv2_1/3/neg" precision="FP32" type="Power">
			<data power="1.0" scale="-1.0" shift="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>24</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="686" name="conv2_1/3/concat" precision="FP32" type="Concat">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>24</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>48</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="447" name="conv2_1/3/scale" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>48</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1124352" size="192"/>
				<biases offset="1171456" size="192"/>
			</blobs>
		</layer>
		<layer id="732" name="conv2_1/3/relu" precision="FP32" type="ReLU">
			<data engine="caffe.ReLUParameter.DEFAULT" negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>48</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="137" name="conv2_1/3/conv" precision="FP32" type="Convolution">
			<data dilation-x="1" dilation-y="1" group="1" kernel-x="1" kernel-y="1" output="64" pad-x="0" pad-y="0" stride="1,1,1,1" stride-x="1" stride-y="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</output>
			<blobs>
				<weights offset="4301888" size="12288"/>
				<biases offset="2754176" size="256"/>
			</blobs>
		</layer>
		<layer id="619" name="conv2_1" precision="FP32" type="Eltwise">
			<data coeff="1.0,1.0" operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="218" name="conv2_2/input" precision="FP32" type="Power">
			<data power="1.0" scale="1.0" shift="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="602" name="conv2_2/1/bn" precision="FP32" type="BatchNormalization">
			<data epsilon="9.999999747378752e-06"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</output>
			<blobs>
				<biases offset="1128064" size="256"/>
				<weights offset="3132544" size="256"/>
			</blobs>
		</layer>
		<layer id="493" name="conv2_2/1/bn_scale" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1124000" size="256"/>
				<biases offset="1127808" size="256"/>
			</blobs>
		</layer>
		<layer id="315" name="conv2_2/1/relu" precision="FP32" type="ReLU">
			<data engine="caffe.ReLUParameter.DEFAULT" negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="457" name="conv2_2/1/conv" precision="FP32" type="Convolution">
			<data dilation-x="1" dilation-y="1" group="1" kernel-x="1" kernel-y="1" output="24" pad-x="0" pad-y="0" stride="1,1,1,1" stride-x="1" stride-y="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>24</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</output>
			<blobs>
				<weights offset="11680" size="6144"/>
				<biases offset="3616416" size="96"/>
			</blobs>
		</layer>
		<layer id="574" name="conv2_2/2/bn" precision="FP32" type="BatchNormalization">
			<data epsilon="9.999999747378752e-06"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>24</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</output>
			<blobs>
				<biases offset="1868384" size="96"/>
				<weights offset="1792" size="96"/>
			</blobs>
		</layer>
		<layer id="729" name="conv2_2/2/bn_scale" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>24</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2481696" size="96"/>
				<biases offset="3616320" size="96"/>
			</blobs>
		</layer>
		<layer id="657" name="conv2_2/2/relu" precision="FP32" type="ReLU">
			<data engine="caffe.ReLUParameter.DEFAULT" negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>24</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="648" name="conv2_2/2/conv" precision="FP32" type="Convolution">
			<data dilation-x="1" dilation-y="1" group="1" kernel-x="3" kernel-y="3" output="24" pad-x="1" pad-y="1" stride="1,1,1,1" stride-x="1" stride-y="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>24</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2732992" size="20736"/>
				<biases offset="2627136" size="96"/>
			</blobs>
		</layer>
		<layer id="775" name="conv2_2/3/bn" precision="FP32" type="BatchNormalization">
			<data epsilon="9.999999747378752e-06"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>24</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</output>
			<blobs>
				<biases offset="4301792" size="96"/>
				<weights offset="4380672" size="96"/>
			</blobs>
		</layer>
		<layer id="94" name="conv2_2/3/neg" precision="FP32" type="Power">
			<data power="1.0" scale="-1.0" shift="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>24</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="133" name="conv2_2/3/concat" precision="FP32" type="Concat">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>24</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>48</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="428" name="conv2_2/3/scale" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>48</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1127424" size="192"/>
				<biases offset="2351904" size="192"/>
			</blobs>
		</layer>
		<layer id="350" name="conv2_2/3/relu" precision="FP32" type="ReLU">
			<data engine="caffe.ReLUParameter.DEFAULT" negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>48</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="675" name="conv2_2/3/conv" precision="FP32" type="Convolution">
			<data dilation-x="1" dilation-y="1" group="1" kernel-x="1" kernel-y="1" output="64" pad-x="0" pad-y="0" stride="1,1,1,1" stride-x="1" stride-y="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2360288" size="12288"/>
				<biases offset="1343136" size="256"/>
			</blobs>
		</layer>
		<layer id="735" name="conv2_2" precision="FP32" type="Eltwise">
			<data coeff="1.0,1.0" operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="226" name="conv2_3/input" precision="FP32" type="Power">
			<data power="1.0" scale="1.0" shift="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="722" name="conv2_3/1/bn" precision="FP32" type="BatchNormalization">
			<data epsilon="9.999999747378752e-06"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</output>
			<blobs>
				<biases offset="1705568" size="256"/>
				<weights offset="2753920" size="256"/>
			</blobs>
		</layer>
		<layer id="400" name="conv2_3/1/bn_scale" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3401152" size="256"/>
				<biases offset="3996384" size="256"/>
			</blobs>
		</layer>
		<layer id="318" name="conv2_3/1/relu" precision="FP32" type="ReLU">
			<data engine="caffe.ReLUParameter.DEFAULT" negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="699" name="conv2_3/1/conv" precision="FP32" type="Convolution">
			<data dilation-x="1" dilation-y="1" group="1" kernel-x="1" kernel-y="1" output="24" pad-x="0" pad-y="0" stride="1,1,1,1" stride-x="1" stride-y="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>24</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1952736" size="6144"/>
				<biases offset="3740992" size="96"/>
			</blobs>
		</layer>
		<layer id="578" name="conv2_3/2/bn" precision="FP32" type="BatchNormalization">
			<data epsilon="9.999999747378752e-06"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>24</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</output>
			<blobs>
				<biases offset="3774112" size="96"/>
				<weights offset="3930560" size="96"/>
			</blobs>
		</layer>
		<layer id="575" name="conv2_3/2/bn_scale" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>24</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1406240" size="96"/>
				<biases offset="2026048" size="96"/>
			</blobs>
		</layer>
		<layer id="540" name="conv2_3/2/relu" precision="FP32" type="ReLU">
			<data engine="caffe.ReLUParameter.DEFAULT" negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>24</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="364" name="conv2_3/2/conv" precision="FP32" type="Convolution">
			<data dilation-x="1" dilation-y="1" group="1" kernel-x="3" kernel-y="3" output="24" pad-x="1" pad-y="1" stride="1,1,1,1" stride-x="1" stride-y="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>24</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</output>
			<blobs>
				<weights offset="4381888" size="20736"/>
				<biases offset="2352288" size="96"/>
			</blobs>
		</layer>
		<layer id="134" name="conv2_3/3/bn" precision="FP32" type="BatchNormalization">
			<data epsilon="9.999999747378752e-06"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>24</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</output>
			<blobs>
				<biases offset="3775008" size="96"/>
				<weights offset="2349760" size="96"/>
			</blobs>
		</layer>
		<layer id="440" name="conv2_3/3/neg" precision="FP32" type="Power">
			<data power="1.0" scale="-1.0" shift="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>24</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="267" name="conv2_3/3/concat" precision="FP32" type="Concat">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>24</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>48</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="730" name="conv2_3/3/scale" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>48</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3930368" size="192"/>
				<biases offset="4379712" size="192"/>
			</blobs>
		</layer>
		<layer id="238" name="conv2_3/3/relu" precision="FP32" type="ReLU">
			<data engine="caffe.ReLUParameter.DEFAULT" negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>48</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="conv2_3/3/conv" precision="FP32" type="Convolution">
			<data dilation-x="1" dilation-y="1" group="1" kernel-x="1" kernel-y="1" output="64" pad-x="0" pad-y="0" stride="1,1,1,1" stride-x="1" stride-y="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2482752" size="12288"/>
				<biases offset="2731712" size="256"/>
			</blobs>
		</layer>
		<layer id="514" name="conv2_3" precision="FP32" type="Eltwise">
			<data coeff="1.0,1.0" operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="conv3_1/1/bn" precision="FP32" type="BatchNormalization">
			<data epsilon="9.999999747378752e-06"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</output>
			<blobs>
				<biases offset="1704800" size="256"/>
				<weights offset="2357216" size="256"/>
			</blobs>
		</layer>
		<layer id="484" name="conv3_1/1/bn_scale" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</output>
			<blobs>
				<weights offset="382112" size="256"/>
				<biases offset="1128576" size="256"/>
			</blobs>
		</layer>
		<layer id="670" name="conv3_1/1/relu" precision="FP32" type="ReLU">
			<data engine="caffe.ReLUParameter.DEFAULT" negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="conv3_1/proj" precision="FP32" type="Convolution">
			<data dilation-x="1" dilation-y="1" group="1" kernel-x="1" kernel-y="1" output="128" pad-x="0" pad-y="0" stride="1,1,2,2" stride-x="2" stride-y="2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3741344" size="32768"/>
				<biases offset="2730176" size="512"/>
			</blobs>
		</layer>
		<layer id="767" name="conv3_1/1/conv" precision="FP32" type="Convolution">
			<data dilation-x="1" dilation-y="1" group="1" kernel-x="1" kernel-y="1" output="48" pad-x="0" pad-y="0" stride="1,1,2,2" stride-x="2" stride-y="2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>40</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>48</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1706848" size="12288"/>
				<biases offset="1127616" size="192"/>
			</blobs>
		</layer>
		<layer id="605" name="conv3_1/2/bn" precision="FP32" type="BatchNormalization">
			<data epsilon="9.999999747378752e-06"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>48</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</output>
			<blobs>
				<biases offset="11296" size="192"/>
				<weights offset="2351328" size="192"/>
			</blobs>
		</layer>
		<layer id="442" name="conv3_1/2/bn_scale" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>48</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1405856" size="192"/>
				<biases offset="2352096" size="192"/>
			</blobs>
		</layer>
		<layer id="363" name="conv3_1/2/relu" precision="FP32" type="ReLU">
			<data engine="caffe.ReLUParameter.DEFAULT" negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>48</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="358" name="conv3_1/2/conv" precision="FP32" type="Convolution">
			<data dilation-x="1" dilation-y="1" group="1" kernel-x="3" kernel-y="3" output="48" pad-x="1" pad-y="1" stride="1,1,1,1" stride-x="1" stride-y="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>48</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2372768" size="82944"/>
				<biases offset="2025856" size="192"/>
			</blobs>
		</layer>
		<layer id="1" name="conv3_1/3/bn" precision="FP32" type="BatchNormalization">
			<data epsilon="9.999999747378752e-06"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>48</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</output>
			<blobs>
				<biases offset="1122400" size="192"/>
				<weights offset="3774816" size="192"/>
			</blobs>
		</layer>
		<layer id="689" name="conv3_1/3/neg" precision="FP32" type="Power">
			<data power="1.0" scale="-1.0" shift="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>48</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="563" name="conv3_1/3/concat" precision="FP32" type="Concat">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>48</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>96</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="conv3_1/3/scale" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>96</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2356832" size="384"/>
				<biases offset="2025280" size="384"/>
			</blobs>
		</layer>
		<layer id="562" name="conv3_1/3/relu" precision="FP32" type="ReLU">
			<data engine="caffe.ReLUParameter.DEFAULT" negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="conv3_1/3/conv" precision="FP32" type="Convolution">
			<data dilation-x="1" dilation-y="1" group="1" kernel-x="1" kernel-y="1" output="128" pad-x="0" pad-y="0" stride="1,1,1,1" stride-x="1" stride-y="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2577984" size="49152"/>
				<biases offset="1407968" size="512"/>
			</blobs>
		</layer>
		<layer id="201" name="conv3_1" precision="FP32" type="Eltwise">
			<data coeff="1.0,1.0" operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>128</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="537" name="conv3_2/1/bn" precision="FP32" type="BatchNormalization">
			<data epsilon="9.999999747378752e-06"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</output>
			<blobs>
				<biases offset="2321408" size="512"/>
				<weights offset="1705056" size="512"/>
			</blobs>
		</layer>
		<layer id="598" name="conv3_2/1/bn_scale" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3616512" size="512"/>
				<biases offset="4217824" size="512"/>
			</blobs>
		</layer>
		<layer id="346" name="conv3_2/1/relu" precision="FP32" type="ReLU">
			<data engine="caffe.ReLUParameter.DEFAULT" negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="684" name="conv3_2/1/conv" precision="FP32" type="Convolution">
			<data dilation-x="1" dilation-y="1" group="1" kernel-x="1" kernel-y="1" output="48" pad-x="0" pad-y="0" stride="1,1,1,1" stride-x="1" stride-y="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>48</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3617024" size="24576"/>
				<biases offset="1952192" size="192"/>
			</blobs>
		</layer>
		<layer id="499" name="conv3_2/2/bn" precision="FP32" type="BatchNormalization">
			<data epsilon="9.999999747378752e-06"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>48</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</output>
			<blobs>
				<biases offset="3616032" size="192"/>
				<weights offset="2456544" size="192"/>
			</blobs>
		</layer>
		<layer id="475" name="conv3_2/2/bn_scale" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>48</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2347328" size="192"/>
				<biases offset="538272" size="192"/>
			</blobs>
		</layer>
		<layer id="410" name="conv3_2/2/relu" precision="FP32" type="ReLU">
			<data engine="caffe.ReLUParameter.DEFAULT" negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>48</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="387" name="conv3_2/2/conv" precision="FP32" type="Convolution">
			<data dilation-x="1" dilation-y="1" group="1" kernel-x="3" kernel-y="3" output="48" pad-x="1" pad-y="1" stride="1,1,1,1" stride-x="1" stride-y="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>48</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1221696" size="82944"/>
				<biases offset="2456928" size="192"/>
			</blobs>
		</layer>
		<layer id="245" name="conv3_2/3/bn" precision="FP32" type="BatchNormalization">
			<data epsilon="9.999999747378752e-06"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>48</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</output>
			<blobs>
				<biases offset="1124544" size="192"/>
				<weights offset="2346752" size="192"/>
			</blobs>
		</layer>
		<layer id="328" name="conv3_2/3/neg" precision="FP32" type="Power">
			<data power="1.0" scale="-1.0" shift="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>48</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="704" name="conv3_2/3/concat" precision="FP32" type="Concat">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>48</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>96</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="509" name="conv3_2/3/scale" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>96</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2356448" size="384"/>
				<biases offset="1122592" size="384"/>
			</blobs>
		</layer>
		<layer id="28" name="conv3_2/3/relu" precision="FP32" type="ReLU">
			<data engine="caffe.ReLUParameter.DEFAULT" negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="409" name="conv3_2/3/conv" precision="FP32" type="Convolution">
			<data dilation-x="1" dilation-y="1" group="1" kernel-x="1" kernel-y="1" output="128" pad-x="0" pad-y="0" stride="1,1,1,1" stride-x="1" stride-y="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1171840" size="49152"/>
				<biases offset="1802080" size="512"/>
			</blobs>
		</layer>
		<layer id="252" name="conv3_2/input" precision="FP32" type="Power">
			<data power="1.0" scale="1.0" shift="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="663" name="conv3_2" precision="FP32" type="Eltwise">
			<data coeff="1.0,1.0" operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>128</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="459" name="conv3_3/1/bn" precision="FP32" type="BatchNormalization">
			<data epsilon="9.999999747378752e-06"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</output>
			<blobs>
				<biases offset="1121184" size="512"/>
				<weights offset="2352864" size="512"/>
			</blobs>
		</layer>
		<layer id="635" name="conv3_3/1/bn_scale" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1125248" size="512"/>
				<biases offset="1706336" size="512"/>
			</blobs>
		</layer>
		<layer id="586" name="conv3_3/1/relu" precision="FP32" type="ReLU">
			<data engine="caffe.ReLUParameter.DEFAULT" negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="382" name="conv3_3/1/conv" precision="FP32" type="Convolution">
			<data dilation-x="1" dilation-y="1" group="1" kernel-x="1" kernel-y="1" output="48" pad-x="0" pad-y="0" stride="1,1,1,1" stride-x="1" stride-y="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>48</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</output>
			<blobs>
				<weights offset="382368" size="24576"/>
				<biases offset="1329408" size="192"/>
			</blobs>
		</layer>
		<layer id="86" name="conv3_3/2/bn" precision="FP32" type="BatchNormalization">
			<data epsilon="9.999999747378752e-06"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>48</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</output>
			<blobs>
				<biases offset="2351712" size="192"/>
				<weights offset="83616" size="192"/>
			</blobs>
		</layer>
		<layer id="146" name="conv3_3/2/bn_scale" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>48</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2349056" size="192"/>
				<biases offset="2025664" size="192"/>
			</blobs>
		</layer>
		<layer id="39" name="conv3_3/2/relu" precision="FP32" type="ReLU">
			<data engine="caffe.ReLUParameter.DEFAULT" negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>48</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="244" name="conv3_3/2/conv" precision="FP32" type="Convolution">
			<data dilation-x="1" dilation-y="1" group="1" kernel-x="3" kernel-y="3" output="48" pad-x="1" pad-y="1" stride="1,1,1,1" stride-x="1" stride-y="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>48</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2495040" size="82944"/>
				<biases offset="2349856" size="192"/>
			</blobs>
		</layer>
		<layer id="35" name="conv3_3/3/bn" precision="FP32" type="BatchNormalization">
			<data epsilon="9.999999747378752e-06"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>48</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</output>
			<blobs>
				<biases offset="1221504" size="192"/>
				<weights offset="2360096" size="192"/>
			</blobs>
		</layer>
		<layer id="556" name="conv3_3/3/neg" precision="FP32" type="Power">
			<data power="1.0" scale="-1.0" shift="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>48</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="476" name="conv3_3/3/concat" precision="FP32" type="Concat">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>48</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>96</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="765" name="conv3_3/3/scale" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>96</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1340608" size="384"/>
				<biases offset="3641600" size="384"/>
			</blobs>
		</layer>
		<layer id="17" name="conv3_3/3/relu" precision="FP32" type="ReLU">
			<data engine="caffe.ReLUParameter.DEFAULT" negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="conv3_3/3/conv" precision="FP32" type="Convolution">
			<data dilation-x="1" dilation-y="1" group="1" kernel-x="1" kernel-y="1" output="128" pad-x="0" pad-y="0" stride="1,1,1,1" stride-x="1" stride-y="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</output>
			<blobs>
				<weights offset="84832" size="49152"/>
				<biases offset="1128832" size="512"/>
			</blobs>
		</layer>
		<layer id="116" name="conv3_3/input" precision="FP32" type="Power">
			<data power="1.0" scale="1.0" shift="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="677" name="conv3_3" precision="FP32" type="Eltwise">
			<data coeff="1.0,1.0" operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>128</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="131" name="conv3_4/input" precision="FP32" type="Power">
			<data power="1.0" scale="1.0" shift="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="276" name="conv3_4/1/bn" precision="FP32" type="BatchNormalization">
			<data epsilon="9.999999747378752e-06"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</output>
			<blobs>
				<biases offset="3774208" size="512"/>
				<weights offset="381504" size="512"/>
			</blobs>
		</layer>
		<layer id="491" name="conv3_4/1/bn_scale" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>20</dim>
					<dim>10</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1705824" size="512"/>
				<biases offset="2359392" size="512"/>
			</blobs>
		</layer>
		<layer id="596" name="conv3_4/1/relu" precision="FP32" type="ReLU">
			<data engine="caffe.ReLUParameter.DEFAULT" negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
