<net name="re_id" version="2" batch="1">
    <layers>
        <layer name="input" type="Input" precision="FP32" id="0">
            <output>
                <port id="0">
                    <dim>1</dim>
                    <dim>3</dim>
                    <dim>96</dim>
                    <dim>48</dim>
                </port>
            </output>
        </layer>
        <layer name="data_norm_scale" type="ScaleShift" precision="FP32" id="1">
            <input>
                <port id="1">
                    <dim>1</dim>
                    <dim>3</dim>
                    <dim>96</dim>
                    <dim>48</dim>
                </port>
            </input>
            <output>
                <port id="2">
                    <dim>1</dim>
                    <dim>3</dim>
                    <dim>96</dim>
                    <dim>48</dim>
                </port>
            </output>
            <weights offset="0" size="12"/>
            <biases offset="12" size="12"/>
        </layer>
        <layer name="init_block1_dim_inc_conv" type="Convolution" precision="FP32" id="2">
            <convolution_data stride-x="2" stride-y="2" pad-x="1" pad-y="1" kernel-x="3" kernel-y="3" output="32" group="1"/>
            <input>
                <port id="3">
                    <dim>1</dim>
                    <dim>3</dim>
                    <dim>96</dim>
                    <dim>48</dim>
                </port>
            </input>
            <output>
                <port id="4">
                    <dim>1</dim>
                    <dim>32</dim>
                    <dim>48</dim>
                    <dim>24</dim>
                </port>
            </output>
            <weights offset="24" size="3456"/>
            <biases offset="3480" size="128"/>
        </layer>
        <layer name="init_block1_dim_inc_fn" type="ReLU" precision="FP32" id="3">
            <input>
                <port id="5">
                    <dim>1</dim>
                    <dim>32</dim>
                    <dim>48</dim>
                    <dim>24</dim>
                </port>
            </input>
            <output>
                <port id="6">
                    <dim>1</dim>
                    <dim>32</dim>
                    <dim>48</dim>
                    <dim>24</dim>
                </port>
            </output>
        </layer>
        <layer name="bottleneck1_1_dim_red_conv" type="Convolution" precision="FP32" id="4">
            <convolution_data stride-x="1" stride-y="1" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="8" group="1"/>
            <input>
                <port id="7">
                    <dim>1</dim>
                    <dim>32</dim>
                    <dim>48</dim>
                    <dim>24</dim>
                </port>
            </input>
            <output>
                <port id="8">
                    <dim>1</dim>
                    <dim>8</dim>
                    <dim>48</dim>
                    <dim>24</dim>
                </port>
            </output>
            <weights offset="3608" size="1024"/>
            <biases offset="4632" size="32"/>
        </layer>
        <layer name="bottleneck1_1_dim_red_fn" type="ELU" precision="FP32" id="5">
            <input>
                <port id="9">
                    <dim>1</dim>
                    <dim>8</dim>
                    <dim>48</dim>
                    <dim>24</dim>
                </port>
            </input>
            <output>
                <port id="10">
                    <dim>1</dim>
                    <dim>8</dim>
                    <dim>48</dim>
                    <dim>24</dim>
                </port>
            </output>
        </layer>
        <layer name="bottleneck1_1_inner_dw1_conv" type="Convolution" precision="FP32" id="6">
            <convolution_data stride-x="1" stride-y="1" pad-x="1" pad-y="1" kernel-x="3" kernel-y="3" output="8" group="8"/>
            <input>
                <port id="11">
                    <dim>1</dim>
                    <dim>8</dim>
                    <dim>48</dim>
                    <dim>24</dim>
                </port>
            </input>
            <output>
                <port id="12">
                    <dim>1</dim>
                    <dim>8</dim>
                    <dim>48</dim>
                    <dim>24</dim>
                </port>
            </output>
            <weights offset="4664" size="288"/>
            <biases offset="4952" size="32"/>
        </layer>
        <layer name="bottleneck1_1_inner_dw1_fn" type="ELU" precision="FP32" id="7">
            <input>
                <port id="13">
                    <dim>1</dim>
                    <dim>8</dim>
                    <dim>48</dim>
                    <dim>24</dim>
                </port>
            </input>
            <output>
                <port id="14">
                    <dim>1</dim>
                    <dim>8</dim>
                    <dim>48</dim>
                    <dim>24</dim>
                </port>
            </output>
        </layer>
        <layer name="bottleneck1_1_dim_inc_conv" type="Convolution" precision="FP32" id="8">
            <convolution_data stride-x="1" stride-y="1" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="32" group="1"/>
            <input>
                <port id="15">
                    <dim>1</dim>
                    <dim>8</dim>
                    <dim>48</dim>
                    <dim>24</dim>
                </port>
            </input>
            <output>
                <port id="16">
                    <dim>1</dim>
                    <dim>32</dim>
                    <dim>48</dim>
                    <dim>24</dim>
                </port>
            </output>
            <weights offset="4984" size="1024"/>
            <biases offset="6008" size="128"/>
        </layer>
        <layer name="bottleneck1_1_add" type="Eltwise" precision="FP32" id="9">
            <elementwise_data operation="sum"/>
            <input>
                <port id="17">
                    <dim>1</dim>
                    <dim>32</dim>
                    <dim>48</dim>
                    <dim>24</dim>
                </port>
                <port id="18">
                    <dim>1</dim>
                    <dim>32</dim>
                    <dim>48</dim>
                    <dim>24</dim>
                </port>
            </input>
            <output>
                <port id="19">
                    <dim>1</dim>
                    <dim>32</dim>
                    <dim>48</dim>
                    <dim>24</dim>
                </port>
            </output>
        </layer>
        <layer name="bottleneck1_1_fn" type="ELU" precision="FP32" id="10">
            <input>
                <port id="20">
                    <dim>1</dim>
                    <dim>32</dim>
                    <dim>48</dim>
                    <dim>24</dim>
                </port>
            </input>
            <output>
                <port id="21">
                    <dim>1</dim>
                    <dim>32</dim>
                    <dim>48</dim>
                    <dim>24</dim>
                </port>
            </output>
        </layer>
        <layer name="bottleneck1_2_dim_red_conv" type="Convolution" precision="FP32" id="11">
            <convolution_data stride-x="1" stride-y="1" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="8" group="1"/>
            <input>
                <port id="22">
                    <dim>1</dim>
                    <dim>32</dim>
                    <dim>48</dim>
                    <dim>24</dim>
                </port>
            </input>
            <output>
                <port id="23">
                    <dim>1</dim>
                    <dim>8</dim>
                    <dim>48</dim>
                    <dim>24</dim>
                </port>
            </output>
            <weights offset="6136" size="1024"/>
            <biases offset="7160" size="32"/>
        </layer>
        <layer name="bottleneck1_2_dim_red_fn" type="ELU" precision="FP32" id="12">
            <input>
                <port id="24">
                    <dim>1</dim>
                    <dim>8</dim>
                    <dim>48</dim>
                    <dim>24</dim>
                </port>
            </input>
            <output>
                <port id="25">
                    <dim>1</dim>
                    <dim>8</dim>
                    <dim>48</dim>
                    <dim>24</dim>
                </port>
            </output>
        </layer>
        <layer name="bottleneck1_2_inner_dw1_conv" type="Convolution" precision="FP32" id="13">
            <convolution_data stride-x="1" stride-y="1" pad-x="1" pad-y="1" kernel-x="3" kernel-y="3" output="8" group="8"/>
            <input>
                <port id="26">
                    <dim>1</dim>
                    <dim>8</dim>
                    <dim>48</dim>
                    <dim>24</dim>
                </port>
            </input>
            <output>
                <port id="27">
                    <dim>1</dim>
                    <dim>8</dim>
                    <dim>48</dim>
                    <dim>24</dim>
                </port>
            </output>
            <weights offset="7192" size="288"/>
            <biases offset="7480" size="32"/>
        </layer>
        <layer name="bottleneck1_2_inner_dw1_fn" type="ELU" precision="FP32" id="14">
            <input>
                <port id="28">
                    <dim>1</dim>
                    <dim>8</dim>
                    <dim>48</dim>
                    <dim>24</dim>
                </port>
            </input>
            <output>
                <port id="29">
                    <dim>1</dim>
                    <dim>8</dim>
                    <dim>48</dim>
                    <dim>24</dim>
                </port>
            </output>
        </layer>
        <layer name="bottleneck1_2_dim_inc_conv" type="Convolution" precision="FP32" id="15">
            <convolution_data stride-x="1" stride-y="1" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="32" group="1"/>
            <input>
                <port id="30">
                    <dim>1</dim>
                    <dim>8</dim>
                    <dim>48</dim>
                    <dim>24</dim>
                </port>
            </input>
            <output>
                <port id="31">
                    <dim>1</dim>
                    <dim>32</dim>
                    <dim>48</dim>
                    <dim>24</dim>
                </port>
            </output>
            <weights offset="7512" size="1024"/>
            <biases offset="8536" size="128"/>
        </layer>
        <layer name="bottleneck1_2_add" type="Eltwise" precision="FP32" id="16">
            <elementwise_data operation="sum"/>
            <input>
                <port id="32">
                    <dim>1</dim>
                    <dim>32</dim>
                    <dim>48</dim>
                    <dim>24</dim>
                </port>
                <port id="33">
                    <dim>1</dim>
                    <dim>32</dim>
                    <dim>48</dim>
                    <dim>24</dim>
                </port>
            </input>
            <output>
                <port id="34">
                    <dim>1</dim>
                    <dim>32</dim>
                    <dim>48</dim>
                    <dim>24</dim>
                </port>
            </output>
        </layer>
        <layer name="bottleneck1_2_fn" type="ELU" precision="FP32" id="17">
            <input>
                <port id="35">
                    <dim>1</dim>
                    <dim>32</dim>
                    <dim>48</dim>
                    <dim>24</dim>
                </port>
            </input>
            <output>
                <port id="36">
                    <dim>1</dim>
                    <dim>32</dim>
                    <dim>48</dim>
                    <dim>24</dim>
                </port>
            </output>
        </layer>
        <layer name="bottleneck1_3_dim_red_conv" type="Convolution" precision="FP32" id="18">
            <convolution_data stride-x="1" stride-y="1" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="8" group="1"/>
            <input>
                <port id="37">
                    <dim>1</dim>
                    <dim>32</dim>
                    <dim>48</dim>
                    <dim>24</dim>
                </port>
            </input>
            <output>
                <port id="38">
                    <dim>1</dim>
                    <dim>8</dim>
                    <dim>48</dim>
                    <dim>24</dim>
                </port>
            </output>
            <weights offset="8664" size="1024"/>
            <biases offset="9688" size="32"/>
        </layer>
        <layer name="bottleneck1_3_dim_red_fn" type="ELU" precision="FP32" id="19">
            <input>
                <port id="39">
                    <dim>1</dim>
                    <dim>8</dim>
                    <dim>48</dim>
                    <dim>24</dim>
                </port>
            </input>
            <output>
                <port id="40">
                    <dim>1</dim>
                    <dim>8</dim>
                    <dim>48</dim>
                    <dim>24</dim>
                </port>
            </output>
        </layer>
        <layer name="bottleneck1_3_inner_dw1_conv" type="Convolution" precision="FP32" id="20">
            <convolution_data stride-x="1" stride-y="1" pad-x="1" pad-y="1" kernel-x="3" kernel-y="3" output="8" group="8"/>
            <input>
                <port id="41">
                    <dim>1</dim>
                    <dim>8</dim>
                    <dim>48</dim>
                    <dim>24</dim>
                </port>
            </input>
            <output>
                <port id="42">
                    <dim>1</dim>
                    <dim>8</dim>
                    <dim>48</dim>
                    <dim>24</dim>
                </port>
            </output>
            <weights offset="9720" size="288"/>
            <biases offset="10008" size="32"/>
        </layer>
        <layer name="bottleneck1_3_inner_dw1_fn" type="ELU" precision="FP32" id="21">
            <input>
                <port id="43">
                    <dim>1</dim>
                    <dim>8</dim>
                    <dim>48</dim>
                    <dim>24</dim>
                </port>
            </input>
            <output>
                <port id="44">
                    <dim>1</dim>
                    <dim>8</dim>
                    <dim>48</dim>
                    <dim>24</dim>
                </port>
            </output>
        </layer>
        <layer name="bottleneck1_3_dim_inc_conv" type="Convolution" precision="FP32" id="22">
            <convolution_data stride-x="1" stride-y="1" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="32" group="1"/>
            <input>
                <port id="45">
                    <dim>1</dim>
                    <dim>8</dim>
                    <dim>48</dim>
                    <dim>24</dim>
                </port>
            </input>
            <output>
                <port id="46">
                    <dim>1</dim>
                    <dim>32</dim>
                    <dim>48</dim>
                    <dim>24</dim>
                </port>
            </output>
            <weights offset="10040" size="1024"/>
            <biases offset="11064" size="128"/>
        </layer>
        <layer name="bottleneck1_3_add" type="Eltwise" precision="FP32" id="23">
            <elementwise_data operation="sum"/>
            <input>
                <port id="47">
                    <dim>1</dim>
                    <dim>32</dim>
                    <dim>48</dim>
                    <dim>24</dim>
                </port>
                <port id="48">
                    <dim>1</dim>
                    <dim>32</dim>
                    <dim>48</dim>
                    <dim>24</dim>
                </port>
            </input>
            <output>
                <port id="49">
                    <dim>1</dim>
                    <dim>32</dim>
                    <dim>48</dim>
                    <dim>24</dim>
                </port>
            </output>
        </layer>
        <layer name="bottleneck1_3_fn" type="ELU" precision="FP32" id="24">
            <input>
                <port id="50">
                    <dim>1</dim>
                    <dim>32</dim>
                    <dim>48</dim>
                    <dim>24</dim>
                </port>
            </input>
            <output>
                <port id="51">
                    <dim>1</dim>
                    <dim>32</dim>
                    <dim>48</dim>
                    <dim>24</dim>
                </port>
            </output>
        </layer>
        <layer name="bottleneck2_0_skip_pooling" type="Pooling" precision="FP32" id="30">
            <pooling_data kernel-x="2" kernel-y="2" pad-x="0" pad-y="0" stride-x="2" stride-y="2" rounding-type="ceil" pool-method="max"/>
            <input>
                <port id="62">
                    <dim>1</dim>
                    <dim>32</dim>
                    <dim>48</dim>
                    <dim>24</dim>
                </port>
            </input>
            <output>
                <port id="63">
                    <dim>1</dim>
                    <dim>32</dim>
                    <dim>24</dim>
                    <dim>12</dim>
                </port>
            </output>
        </layer>
        <layer name="bottleneck2_0_skip_conv" type="Convolution" precision="FP32" id="31">
            <convolution_data stride-x="1" stride-y="1" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="64" group="1"/>
            <input>
                <port id="64">
                    <dim>1</dim>
                    <dim>32</dim>
                    <dim>24</dim>
                    <dim>12</dim>
                </port>
            </input>
            <output>
                <port id="65">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>24</dim>
                    <dim>12</dim>
                </port>
            </output>
            <weights offset="11192" size="8192"/>
            <biases offset="19384" size="256"/>
        </layer>
        <layer name="bottleneck2_0_dim_red_conv" type="Convolution" precision="FP32" id="25">
            <convolution_data stride-x="1" stride-y="1" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="16" group="1"/>
            <input>
                <port id="52">
                    <dim>1</dim>
                    <dim>32</dim>
                    <dim>48</dim>
                    <dim>24</dim>
                </port>
            </input>
            <output>
                <port id="53">
                    <dim>1</dim>
                    <dim>16</dim>
                    <dim>48</dim>
                    <dim>24</dim>
                </port>
            </output>
            <weights offset="19640" size="2048"/>
            <biases offset="21688" size="64"/>
        </layer>
        <layer name="bottleneck2_0_dim_red_fn" type="ELU" precision="FP32" id="26">
            <input>
                <port id="54">
                    <dim>1</dim>
                    <dim>16</dim>
                    <dim>48</dim>
                    <dim>24</dim>
                </port>
            </input>
            <output>
                <port id="55">
                    <dim>1</dim>
                    <dim>16</dim>
                    <dim>48</dim>
                    <dim>24</dim>
                </port>
            </output>
        </layer>
        <layer name="bottleneck2_0_inner_dw1_conv" type="Convolution" precision="FP32" id="27">
            <convolution_data stride-x="2" stride-y="2" pad-x="1" pad-y="1" kernel-x="3" kernel-y="3" output="16" group="16"/>
            <input>
                <port id="56">
                    <dim>1</dim>
                    <dim>16</dim>
                    <dim>48</dim>
                    <dim>24</dim>
                </port>
            </input>
            <output>
                <port id="57">
                    <dim>1</dim>
                    <dim>16</dim>
                    <dim>24</dim>
                    <dim>12</dim>
                </port>
            </output>
            <weights offset="21752" size="576"/>
            <biases offset="22328" size="64"/>
        </layer>
        <layer name="bottleneck2_0_inner_dw1_fn" type="ELU" precision="FP32" id="28">
            <input>
                <port id="58">
                    <dim>1</dim>
                    <dim>16</dim>
                    <dim>24</dim>
                    <dim>12</dim>
                </port>
            </input>
            <output>
                <port id="59">
                    <dim>1</dim>
                    <dim>16</dim>
                    <dim>24</dim>
                    <dim>12</dim>
                </port>
            </output>
        </layer>
        <layer name="bottleneck2_0_dim_inc_conv" type="Convolution" precision="FP32" id="29">
            <convolution_data stride-x="1" stride-y="1" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="64" group="1"/>
            <input>
                <port id="60">
                    <dim>1</dim>
                    <dim>16</dim>
                    <dim>24</dim>
                    <dim>12</dim>
                </port>
            </input>
            <output>
                <port id="61">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>24</dim>
                    <dim>12</dim>
                </port>
            </output>
            <weights offset="22392" size="4096"/>
            <biases offset="26488" size="256"/>
        </layer>
        <layer name="bottleneck2_0_add" type="Eltwise" precision="FP32" id="32">
            <elementwise_data operation="sum"/>
            <input>
                <port id="66">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>24</dim>
                    <dim>12</dim>
                </port>
                <port id="67">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>24</dim>
                    <dim>12</dim>
                </port>
            </input>
            <output>
                <port id="68">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>24</dim>
                    <dim>12</dim>
                </port>
            </output>
        </layer>
        <layer name="bottleneck2_0_fn" type="ELU" precision="FP32" id="33">
            <input>
                <port id="69">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>24</dim>
                    <dim>12</dim>
                </port>
            </input>
            <output>
                <port id="70">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>24</dim>
                    <dim>12</dim>
                </port>
            </output>
        </layer>
        <layer name="bottleneck2_1_dim_red_conv" type="Convolution" precision="FP32" id="34">
            <convolution_data stride-x="1" stride-y="1" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="16" group="1"/>
            <input>
                <port id="71">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>24</dim>
                    <dim>12</dim>
                </port>
            </input>
            <output>
                <port id="72">
                    <dim>1</dim>
                    <dim>16</dim>
                    <dim>24</dim>
                    <dim>12</dim>
                </port>
            </output>
            <weights offset="26744" size="4096"/>
            <biases offset="30840" size="64"/>
        </layer>
        <layer name="bottleneck2_1_dim_red_fn" type="ELU" precision="FP32" id="35">
            <input>
                <port id="73">
                    <dim>1</dim>
                    <dim>16</dim>
                    <dim>24</dim>
                    <dim>12</dim>
                </port>
            </input>
            <output>
                <port id="74">
                    <dim>1</dim>
                    <dim>16</dim>
                    <dim>24</dim>
                    <dim>12</dim>
                </port>
            </output>
        </layer>
        <layer name="bottleneck2_1_inner_dw1_conv" type="Convolution" precision="FP32" id="36">
            <convolution_data stride-x="1" stride-y="1" pad-x="1" pad-y="1" kernel-x="3" kernel-y="3" output="16" group="16"/>
            <input>
                <port id="75">
                    <dim>1</dim>
                    <dim>16</dim>
                    <dim>24</dim>
                    <dim>12</dim>
                </port>
            </input>
            <output>
                <port id="76">
                    <dim>1</dim>
                    <dim>16</dim>
                    <dim>24</dim>
                    <dim>12</dim>
                </port>
            </output>
            <weights offset="30904" size="576"/>
            <biases offset="31480" size="64"/>
        </layer>
        <layer name="bottleneck2_1_inner_dw1_fn" type="ELU" precision="FP32" id="37">
            <input>
                <port id="77">
                    <dim>1</dim>
                    <dim>16</dim>
                    <dim>24</dim>
                    <dim>12</dim>
                </port>
            </input>
            <output>
                <port id="78">
                    <dim>1</dim>
                    <dim>16</dim>
                    <dim>24</dim>
                    <dim>12</dim>
                </port>
            </output>
        </layer>
        <layer name="bottleneck2_1_dim_inc_conv" type="Convolution" precision="FP32" id="38">
            <convolution_data stride-x="1" stride-y="1" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="64" group="1"/>
            <input>
                <port id="79">
                    <dim>1</dim>
                    <dim>16</dim>
                    <dim>24</dim>
                    <dim>12</dim>
                </port>
            </input>
            <output>
                <port id="80">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>24</dim>
                    <dim>12</dim>
                </port>
            </output>
            <weights offset="31544" size="4096"/>
            <biases offset="35640" size="256"/>
        </layer>
        <layer name="bottleneck2_1_add" type="Eltwise" precision="FP32" id="39">
            <elementwise_data operation="sum"/>
            <input>
                <port id="81">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>24</dim>
                    <dim>12</dim>
                </port>
                <port id="82">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>24</dim>
                    <dim>12</dim>
                </port>
            </input>
            <output>
                <port id="83">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>24</dim>
                    <dim>12</dim>
                </port>
            </output>
        </layer>
        <layer name="bottleneck2_1_fn" type="ELU" precision="FP32" id="40">
            <input>
                <port id="84">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>24</dim>
                    <dim>12</dim>
                </port>
            </input>
            <output>
                <port id="85">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>24</dim>
                    <dim>12</dim>
                </port>
            </output>
        </layer>
        <layer name="bottleneck2_2_dim_red_conv" type="Convolution" precision="FP32" id="41">
            <convolution_data stride-x="1" stride-y="1" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="16" group="1"/>
            <input>
                <port id="86">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>24</dim>
                    <dim>12</dim>
                </port>
            </input>
            <output>
                <port id="87">
                    <dim>1</dim>
                    <dim>16</dim>
                    <dim>24</dim>
                    <dim>12</dim>
                </port>
            </output>
            <weights offset="35896" size="4096"/>
            <biases offset="39992" size="64"/>
        </layer>
        <layer name="bottleneck2_2_dim_red_fn" type="ELU" precision="FP32" id="42">
            <input>
                <port id="88">
                    <dim>1</dim>
                    <dim>16</dim>
                    <dim>24</dim>
                    <dim>12</dim>
                </port>
            </input>
            <output>
                <port id="89">
                    <dim>1</dim>
                    <dim>16</dim>
                    <dim>24</dim>
                    <dim>12</dim>
                </port>
            </output>
        </layer>
        <layer name="bottleneck2_2_inner_dw1_conv" type="Convolution" precision="FP32" id="43">
            <convolution_data stride-x="1" stride-y="1" pad-x="1" pad-y="1" kernel-x="3" kernel-y="3" output="16" group="16"/>
            <input>
                <port id="90">
                    <dim>1</dim>
                    <dim>16</dim>
                    <dim>24</dim>
                    <dim>12</dim>
                </port>
            </input>
            <output>
                <port id="91">
                    <dim>1</dim>
                    <dim>16</dim>
                    <dim>24</dim>
                    <dim>12</dim>
                </port>
            </output>
            <weights offset="40056" size="576"/>
            <biases offset="40632" size="64"/>
        </layer>
        <layer name="bottleneck2_2_inner_dw1_fn" type="ELU" precision="FP32" id="44">
            <input>
                <port id="92">
                    <dim>1</dim>
                    <dim>16</dim>
                    <dim>24</dim>
                    <dim>12</dim>
                </port>
            </input>
            <output>
                <port id="93">
                    <dim>1</dim>
                    <dim>16</dim>
                    <dim>24</dim>
                    <dim>12</dim>
                </port>
            </output>
        </layer>
        <layer name="bottleneck2_2_dim_inc_conv" type="Convolution" precision="FP32" id="45">
            <convolution_data stride-x="1" stride-y="1" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="64" group="1"/>
            <input>
                <port id="94">
                    <dim>1</dim>
                    <dim>16</dim>
                    <dim>24</dim>
                    <dim>12</dim>
                </port>
            </input>
            <output>
                <port id="95">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>24</dim>
                    <dim>12</dim>
                </port>
            </output>
            <weights offset="40696" size="4096"/>
            <biases offset="44792" size="256"/>
        </layer>
        <layer name="bottleneck2_2_add" type="Eltwise" precision="FP32" id="46">
            <elementwise_data operation="sum"/>
            <input>
                <port id="96">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>24</dim>
                    <dim>12</dim>
                </port>
                <port id="97">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>24</dim>
                    <dim>12</dim>
                </port>
            </input>
            <output>
                <port id="98">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>24</dim>
                    <dim>12</dim>
                </port>
            </output>
        </layer>
        <layer name="bottleneck2_2_fn" type="ELU" precision="FP32" id="47">
            <input>
                <port id="99">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>24</dim>
                    <dim>12</dim>
                </port>
            </input>
            <output>
                <port id="100">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>24</dim>
                    <dim>12</dim>
                </port>
            </output>
        </layer>
        <layer name="bottleneck2_3_dim_red_conv" type="Convolution" precision="FP32" id="48">
            <convolution_data stride-x="1" stride-y="1" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="16" group="1"/>
            <input>
                <port id="101">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>24</dim>
                    <dim>12</dim>
                </port>
            </input>
            <output>
                <port id="102">
                    <dim>1</dim>
                    <dim>16</dim>
                    <dim>24</dim>
                    <dim>12</dim>
                </port>
            </output>
            <weights offset="45048" size="4096"/>
            <biases offset="49144" size="64"/>
        </layer>
        <layer name="bottleneck2_3_dim_red_fn" type="ELU" precision="FP32" id="49">
            <input>
                <port id="103">
                    <dim>1</dim>
                    <dim>16</dim>
                    <dim>24</dim>
                    <dim>12</dim>
                </port>
            </input>
            <output>
                <port id="104">
                    <dim>1</dim>
                    <dim>16</dim>
                    <dim>24</dim>
                    <dim>12</dim>
                </port>
            </output>
        </layer>
        <layer name="bottleneck2_3_inner_dw1_conv" type="Convolution" precision="FP32" id="50">
            <convolution_data stride-x="1" stride-y="1" pad-x="1" pad-y="1" kernel-x="3" kernel-y="3" output="16" group="16"/>
            <input>
                <port id="105">
                    <dim>1</dim>
                    <dim>16</dim>
                    <dim>24</dim>
                    <dim>12</dim>
                </port>
            </input>
            <output>
                <port id="106">
                    <dim>1</dim>
                    <dim>16</dim>
                    <dim>24</dim>
                    <dim>12</dim>
                </port>
            </output>
            <weights offset="49208" size="576"/>
            <biases offset="49784" size="64"/>
        </layer>
        <layer name="bottleneck2_3_inner_dw1_fn" type="ELU" precision="FP32" id="51">
            <input>
                <port id="107">
                    <dim>1</dim>
                    <dim>16</dim>
                    <dim>24</dim>
                    <dim>12</dim>
                </port>
            </input>
            <output>
                <port id="108">
                    <dim>1</dim>
                    <dim>16</dim>
                    <dim>24</dim>
                    <dim>12</dim>
                </port>
            </output>
        </layer>
        <layer name="bottleneck2_3_dim_inc_conv" type="Convolution" precision="FP32" id="52">
            <convolution_data stride-x="1" stride-y="1" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="64" group="1"/>
            <input>
                <port id="109">
                    <dim>1</dim>
                    <dim>16</dim>
                    <dim>24</dim>
                    <dim>12</dim>
                </port>
            </input>
            <output>
                <port id="110">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>24</dim>
                    <dim>12</dim>
                </port>
            </output>
            <weights offset="49848" size="4096"/>
            <biases offset="53944" size="256"/>
        </layer>
        <layer name="bottleneck2_3_add" type="Eltwise" precision="FP32" id="53">
            <elementwise_data operation="sum"/>
            <input>
                <port id="111">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>24</dim>
                    <dim>12</dim>
                </port>
                <port id="112">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>24</dim>
                    <dim>12</dim>
                </port>
            </input>
            <output>
                <port id="113">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>24</dim>
                    <dim>12</dim>
                </port>
            </output>
        </layer>
        <layer name="bottleneck2_3_fn" type="ELU" precision="FP32" id="54">
            <input>
                <port id="114">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>24</dim>
                    <dim>12</dim>
                </port>
            </input>
            <output>
                <port id="115">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>24</dim>
                    <dim>12</dim>
                </port>
            </output>
        </layer>
        <layer name="bottleneck3_0_skip_pooling" type="Pooling" precision="FP32" id="60">
            <pooling_data kernel-x="2" kernel-y="2" pad-x="0" pad-y="0" stride-x="2" stride-y="2" rounding-type="ceil" pool-method="max"/>
            <input>
                <port id="126">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>24</dim>
                    <dim>12</dim>
                </port>
            </input>
            <output>
                <port id="127">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>12</dim>
                    <dim>6</dim>
                </port>
            </output>
        </layer>
        <layer name="bottleneck3_0_skip_conv" type="Convolution" precision="FP32" id="61">
            <convolution_data stride-x="1" stride-y="1" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="128" group="1"/>
            <input>
                <port id="128">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>12</dim>
                    <dim>6</dim>
                </port>
            </input>
            <output>
                <port id="129">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>12</dim>
                    <dim>6</dim>
                </port>
            </output>
            <weights offset="54200" size="32768"/>
            <biases offset="86968" size="512"/>
        </layer>
        <layer name="bottleneck3_0_dim_red_conv" type="Convolution" precision="FP32" id="55">
            <convolution_data stride-x="1" stride-y="1" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="32" group="1"/>
            <input>
                <port id="116">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>24</dim>
                    <dim>12</dim>
                </port>
            </input>
            <output>
                <port id="117">
                    <dim>1</dim>
                    <dim>32</dim>
                    <dim>24</dim>
                    <dim>12</dim>
                </port>
            </output>
            <weights offset="87480" size="8192"/>
            <biases offset="95672" size="128"/>
        </layer>
        <layer name="bottleneck3_0_dim_red_fn" type="ELU" precision="FP32" id="56">
            <input>
                <port id="118">
                    <dim>1</dim>
                    <dim>32</dim>
                    <dim>24</dim>
                    <dim>12</dim>
                </port>
            </input>
            <output>
                <port id="119">
                    <dim>1</dim>
                    <dim>32</dim>
                    <dim>24</dim>
                    <dim>12</dim>
                </port>
            </output>
        </layer>
        <layer name="bottleneck3_0_inner_dw1_conv" type="Convolution" precision="FP32" id="57">
            <convolution_data stride-x="2" stride-y="2" pad-x="1" pad-y="1" kernel-x="3" kernel-y="3" output="32" group="32"/>
            <input>
                <port id="120">
                    <dim>1</dim>
                    <dim>32</dim>
                    <dim>24</dim>
                    <dim>12</dim>
                </port>
            </input>
            <output>
                <port id="121">
                    <dim>1</dim>
                    <dim>32</dim>
                    <dim>12</dim>
                    <dim>6</dim>
                </port>
            </output>
            <weights offset="95800" size="1152"/>
            <biases offset="96952" size="128"/>
        </layer>
        <layer name="bottleneck3_0_inner_dw1_fn" type="ELU" precision="FP32" id="58">
            <input>
                <port id="122">
                    <dim>1</dim>
                    <dim>32</dim>
                    <dim>12</dim>
                    <dim>6</dim>
                </port>
            </input>
            <output>
                <port id="123">
                    <dim>1</dim>
                    <dim>32</dim>
                    <dim>12</dim>
                    <dim>6</dim>
                </port>
            </output>
        </layer>
        <layer name="bottleneck3_0_dim_inc_conv" type="Convolution" precision="FP32" id="59">
            <convolution_data stride-x="1" stride-y="1" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="128" group="1"/>
            <input>
                <port id="124">
                    <dim>1</dim>
                    <dim>32</dim>
                    <dim>12</dim>
                    <dim>6</dim>
                </port>
            </input>
            <output>
                <port id="125">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>12</dim>
                    <dim>6</dim>
                </port>
            </output>
            <weights offset="97080" size="16384"/>
            <biases offset="113464" size="512"/>
        </layer>
        <layer name="bottleneck3_0_add" type="Eltwise" precision="FP32" id="62">
            <elementwise_data operation="sum"/>
            <input>
                <port id="130">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>12</dim>
                    <dim>6</dim>
                </port>
                <port id="131">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>12</dim>
                    <dim>6</dim>
                </port>
            </input>
            <output>
                <port id="132">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>12</dim>
                    <dim>6</dim>
                </port>
            </output>
        </layer>
        <layer name="bottleneck3_0_fn" type="ELU" precision="FP32" id="63">
            <input>
                <port id="133">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>12</dim>
                    <dim>6</dim>
                </port>
            </input>
            <output>
                <port id="134">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>12</dim>
                    <dim>6</dim>
                </port>
            </output>
        </layer>
        <layer name="bottleneck3_1_dim_red_conv" type="Convolution" precision="FP32" id="64">
            <convolution_data stride-x="1" stride-y="1" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="32" group="1"/>
            <input>
                <port id="135">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>12</dim>
                    <dim>6</dim>
                </port>
            </input>
            <output>
                <port id="136">
                    <dim>1</dim>
                    <dim>32</dim>
                    <dim>12</dim>
                    <dim>6</dim>
                </port>
            </output>
            <weights offset="113976" size="16384"/>
            <biases offset="130360" size="128"/>
        </layer>
        <layer name="bottleneck3_1_dim_red_fn" type="ELU" precision="FP32" id="65">
            <input>
                <port id="137">
                    <dim>1</dim>
                    <dim>32</dim>
                    <dim>12</dim>
                    <dim>6</dim>
                </port>
            </input>
            <output>
                <port id="138">
                    <dim>1</dim>
                    <dim>32</dim>
                    <dim>12</dim>
                    <dim>6</dim>
                </port>
            </output>
        </layer>
        <layer name="bottleneck3_1_inner_dw1_conv" type="Convolution" precision="FP32" id="66">
            <convolution_data stride-x="1" stride-y="1" pad-x="1" pad-y="1" kernel-x="3" kernel-y="3" output="32" group="32"/>
            <input>
                <port id="139">
                    <dim>1</dim>
                    <dim>32</dim>
                    <dim>12</dim>
                    <dim>6</dim>
                </port>
            </input>
            <output>
                <port id="140">
                    <dim>1</dim>
                    <dim>32</dim>
                    <dim>12</dim>
                    <dim>6</dim>
                </port>
            </output>
            <weights offset="130488" size="1152"/>
            <biases offset="131640" size="128"/>
        </layer>
        <layer name="bottleneck3_1_inner_dw1_fn" type="ELU" precision="FP32" id="67">
            <input>
                <port id="141">
                    <dim>1</dim>
                    <dim>32</dim>
                    <dim>12</dim>
                    <dim>6</dim>
                </port>
            </input>
            <output>
                <port id="142">
                    <dim>1</dim>
                    <dim>32</dim>
                    <dim>12</dim>
                    <dim>6</dim>
                </port>
            </output>
        </layer>
        <layer name="bottleneck3_1_dim_inc_conv" type="Convolution" precision="FP32" id="68">
            <convolution_data stride-x="1" stride-y="1" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="128" group="1"/>
            <input>
                <port id="143">
                    <dim>1</dim>
                    <dim>32</dim>
                    <dim>12</dim>
                    <dim>6</dim>
                </port>
            </input>
            <output>
                <port id="144">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>12</dim>
                    <dim>6</dim>
                </port>
            </output>
            <weights offset="131768" size="16384"/>
            <biases offset="148152" size="512"/>
        </layer>
        <layer name="bottleneck3_1_add" type="Eltwise" precision="FP32" id="69">
            <elementwise_data operation="sum"/>
            <input>
                <port id="145">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>12</dim>
                    <dim>6</dim>
                </port>
                <port id="146">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>12</dim>
                    <dim>6</dim>
                </port>
            </input>
            <output>
                <port id="147">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>12</dim>
                    <dim>6</dim>
                </port>
            </output>
        </layer>
        <layer name="bottleneck3_1_fn" type="ELU" precision="FP32" id="70">
            <input>
                <port id="148">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>12</dim>
                    <dim>6</dim>
                </port>
            </input>
            <output>
                <port id="149">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>12</dim>
                    <dim>6</dim>
                </port>
            </output>
        </layer>
        <layer name="bottleneck3_2_dim_red_conv" type="Convolution" precision="FP32" id="71">
            <convolution_data stride-x="1" stride-y="1" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="32" group="1"/>
            <input>
                <port id="150">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>12</dim>
                    <dim>6</dim>
                </port>
            </input>
            <output>
                <port id="151">
                    <dim>1</dim>
                    <dim>32</dim>
                    <dim>12</dim>
                    <dim>6</dim>
