<?xml version="1.0" ?>
<net batch="1" name="text-detection-0001" version="4">
	<layers>
		<layer id="0" name="Placeholder" precision="FP16" type="Input">
			<output>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>768</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="Add_" precision="FP16" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>768</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>3</dim>
					<dim>768</dim>
					<dim>1280</dim>
				</port>
			</output>
			<blobs>
				<weights offset="0" size="6"/>
				<biases offset="6" size="6"/>
			</blobs>
		</layer>
		<layer id="2" name="conv1/Conv/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="3,3" output="32" pads_begin="0,0" pads_end="1,1" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>768</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>384</dim>
					<dim>640</dim>
				</port>
			</output>
			<blobs>
				<weights offset="12" size="1728"/>
				<biases offset="1740" size="64"/>
			</blobs>
		</layer>
		<layer id="3" name="conv1/Relu6" precision="FP16" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>384</dim>
					<dim>640</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>384</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="conv2_1/Conv/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="32" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>384</dim>
					<dim>640</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>384</dim>
					<dim>640</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1804" size="2048"/>
				<biases offset="3852" size="64"/>
			</blobs>
		</layer>
		<layer id="5" name="conv2_1/Relu6" precision="FP16" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>384</dim>
					<dim>640</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>384</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="conv2_1/SeparableConv2d/separable_conv2d/depthwise" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="32" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>384</dim>
					<dim>640</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>384</dim>
					<dim>640</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3916" size="576"/>
			</blobs>
		</layer>
		<layer id="7" name="conv2_1/SeparableConv2d/separable_conv2d" precision="FP16" type="Convolution">
			<data auto_pad="valid" dilations="1,1" group="1" kernel="1,1" output="32" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>384</dim>
					<dim>640</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>384</dim>
					<dim>640</dim>
				</port>
			</output>
			<blobs>
				<weights offset="4492" size="2048"/>
				<biases offset="6540" size="64"/>
			</blobs>
		</layer>
		<layer id="8" name="conv2_1/Relu6_1" precision="FP16" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>384</dim>
					<dim>640</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>384</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="conv2_1/Conv_1/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="16" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>384</dim>
					<dim>640</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>16</dim>
					<dim>384</dim>
					<dim>640</dim>
				</port>
			</output>
			<blobs>
				<weights offset="6604" size="1024"/>
				<biases offset="7628" size="32"/>
			</blobs>
		</layer>
		<layer id="10" name="conv2_2/Conv/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="96" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>384</dim>
					<dim>640</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>96</dim>
					<dim>384</dim>
					<dim>640</dim>
				</port>
			</output>
			<blobs>
				<weights offset="7660" size="3072"/>
				<biases offset="10732" size="192"/>
			</blobs>
		</layer>
		<layer id="11" name="conv2_2/Relu6" precision="FP16" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>384</dim>
					<dim>640</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
					<dim>384</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="conv2_2/SeparableConv2d/separable_conv2d/depthwise" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="96" kernel="3,3" output="96" pads_begin="0,0" pads_end="1,1" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>384</dim>
					<dim>640</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>96</dim>
					<dim>192</dim>
					<dim>320</dim>
				</port>
			</output>
			<blobs>
				<weights offset="10924" size="1728"/>
			</blobs>
		</layer>
		<layer id="13" name="conv2_2/SeparableConv2d/separable_conv2d" precision="FP16" type="Convolution">
			<data auto_pad="valid" dilations="1,1" group="1" kernel="1,1" output="96" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>192</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>96</dim>
					<dim>192</dim>
					<dim>320</dim>
				</port>
			</output>
			<blobs>
				<weights offset="12652" size="18432"/>
				<biases offset="31084" size="192"/>
			</blobs>
		</layer>
		<layer id="14" name="conv2_2/Relu6_1" precision="FP16" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>192</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
					<dim>192</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="conv2_2/Conv_1/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="24" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>192</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>24</dim>
					<dim>192</dim>
					<dim>320</dim>
				</port>
			</output>
			<blobs>
				<weights offset="31276" size="4608"/>
				<biases offset="35884" size="48"/>
			</blobs>
		</layer>
		<layer id="16" name="conv3_1/Conv/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="144" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>192</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>144</dim>
					<dim>192</dim>
					<dim>320</dim>
				</port>
			</output>
			<blobs>
				<weights offset="35932" size="6912"/>
				<biases offset="42844" size="288"/>
			</blobs>
		</layer>
		<layer id="17" name="conv3_1/Relu6" precision="FP16" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>192</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>144</dim>
					<dim>192</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="conv3_1/SeparableConv2d/separable_conv2d/depthwise" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="144" kernel="3,3" output="144" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>192</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>144</dim>
					<dim>192</dim>
					<dim>320</dim>
				</port>
			</output>
			<blobs>
				<weights offset="43132" size="2592"/>
			</blobs>
		</layer>
		<layer id="19" name="conv3_1/SeparableConv2d/separable_conv2d" precision="FP16" type="Convolution">
			<data auto_pad="valid" dilations="1,1" group="1" kernel="1,1" output="144" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>192</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>144</dim>
					<dim>192</dim>
					<dim>320</dim>
				</port>
			</output>
			<blobs>
				<weights offset="45724" size="41472"/>
				<biases offset="87196" size="288"/>
			</blobs>
		</layer>
		<layer id="20" name="conv3_1/Relu6_1" precision="FP16" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>192</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>144</dim>
					<dim>192</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="conv3_1/Conv_1/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="24" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>192</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>24</dim>
					<dim>192</dim>
					<dim>320</dim>
				</port>
			</output>
			<blobs>
				<weights offset="87484" size="6912"/>
				<biases offset="94396" size="48"/>
			</blobs>
		</layer>
		<layer id="22" name="conv3_1/Add" precision="FP16" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>192</dim>
					<dim>320</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>24</dim>
					<dim>192</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>24</dim>
					<dim>192</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="pixel_cls/score_from_conv3_3/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="2" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>192</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>2</dim>
					<dim>192</dim>
					<dim>320</dim>
				</port>
			</output>
			<blobs>
				<weights offset="94444" size="96"/>
				<biases offset="94540" size="4"/>
			</blobs>
		</layer>
		<layer id="24" name="conv3_2/Conv/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="144" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>192</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>144</dim>
					<dim>192</dim>
					<dim>320</dim>
				</port>
			</output>
			<blobs>
				<weights offset="94544" size="6912"/>
				<biases offset="101456" size="288"/>
			</blobs>
		</layer>
		<layer id="25" name="conv3_2/Relu6" precision="FP16" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>192</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>144</dim>
					<dim>192</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="conv3_2/SeparableConv2d/separable_conv2d/depthwise" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="144" kernel="3,3" output="144" pads_begin="0,0" pads_end="1,1" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>192</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>144</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
			<blobs>
				<weights offset="101744" size="2592"/>
			</blobs>
		</layer>
		<layer id="27" name="conv3_2/SeparableConv2d/separable_conv2d" precision="FP16" type="Convolution">
			<data auto_pad="valid" dilations="1,1" group="1" kernel="1,1" output="144" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>144</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
			<blobs>
				<weights offset="104336" size="41472"/>
				<biases offset="145808" size="288"/>
			</blobs>
		</layer>
		<layer id="28" name="conv3_2/Relu6_1" precision="FP16" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>144</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="conv3_2/Conv_1/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="32" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
			<blobs>
				<weights offset="146096" size="9216"/>
				<biases offset="155312" size="64"/>
			</blobs>
		</layer>
		<layer id="30" name="conv4_1/Conv/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="192" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>192</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
			<blobs>
				<weights offset="155376" size="12288"/>
				<biases offset="167664" size="384"/>
			</blobs>
		</layer>
		<layer id="31" name="conv4_1/Relu6" precision="FP16" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>192</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="conv4_1/SeparableConv2d/separable_conv2d/depthwise" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="192" kernel="3,3" output="192" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>192</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
			<blobs>
				<weights offset="168048" size="3456"/>
			</blobs>
		</layer>
		<layer id="33" name="conv4_1/SeparableConv2d/separable_conv2d" precision="FP16" type="Convolution">
			<data auto_pad="valid" dilations="1,1" group="1" kernel="1,1" output="192" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>192</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
			<blobs>
				<weights offset="171504" size="73728"/>
				<biases offset="245232" size="384"/>
			</blobs>
		</layer>
		<layer id="34" name="conv4_1/Relu6_1" precision="FP16" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>192</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="conv4_1/Conv_1/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="32" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
			<blobs>
				<weights offset="245616" size="12288"/>
				<biases offset="257904" size="64"/>
			</blobs>
		</layer>
		<layer id="36" name="conv4_1/Add" precision="FP16" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="conv4_2/Conv/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="192" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>192</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
			<blobs>
				<weights offset="257968" size="12288"/>
				<biases offset="270256" size="384"/>
			</blobs>
		</layer>
		<layer id="38" name="conv4_2/Relu6" precision="FP16" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>192</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="conv4_2/SeparableConv2d/separable_conv2d/depthwise" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="192" kernel="3,3" output="192" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>192</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
			<blobs>
				<weights offset="270640" size="3456"/>
			</blobs>
		</layer>
		<layer id="40" name="conv4_2/SeparableConv2d/separable_conv2d" precision="FP16" type="Convolution">
			<data auto_pad="valid" dilations="1,1" group="1" kernel="1,1" output="192" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>192</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
			<blobs>
				<weights offset="274096" size="73728"/>
				<biases offset="347824" size="384"/>
			</blobs>
		</layer>
		<layer id="41" name="conv4_2/Relu6_1" precision="FP16" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>192</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="conv4_2/Conv_1/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="32" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
			<blobs>
				<weights offset="348208" size="12288"/>
				<biases offset="360496" size="64"/>
			</blobs>
		</layer>
		<layer id="43" name="conv4_2/Add" precision="FP16" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="conv4_3/Conv/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="192" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>192</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
			<blobs>
				<weights offset="360560" size="12288"/>
				<biases offset="372848" size="384"/>
			</blobs>
		</layer>
		<layer id="45" name="conv4_3/Relu6" precision="FP16" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>192</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="conv4_3/SeparableConv2d/separable_conv2d/depthwise" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="192" kernel="3,3" output="192" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>192</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
			<blobs>
				<weights offset="373232" size="3456"/>
			</blobs>
		</layer>
		<layer id="47" name="conv4_3/SeparableConv2d/separable_conv2d" precision="FP16" type="Convolution">
			<data auto_pad="valid" dilations="1,1" group="1" kernel="1,1" output="192" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>192</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
			<blobs>
				<weights offset="376688" size="73728"/>
				<biases offset="450416" size="384"/>
			</blobs>
		</layer>
		<layer id="48" name="conv4_3/Relu6_1" precision="FP16" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>192</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="conv4_3/Conv_1/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="64" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
			<blobs>
				<weights offset="450800" size="24576"/>
				<biases offset="475376" size="128"/>
			</blobs>
		</layer>
		<layer id="50" name="conv4_4/Conv/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="384" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>384</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
			<blobs>
				<weights offset="475504" size="49152"/>
				<biases offset="524656" size="768"/>
			</blobs>
		</layer>
		<layer id="51" name="conv4_4/Relu6" precision="FP16" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>384</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="conv4_4/SeparableConv2d/separable_conv2d/depthwise" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="384" kernel="3,3" output="384" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>384</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
			<blobs>
				<weights offset="525424" size="6912"/>
			</blobs>
		</layer>
		<layer id="53" name="conv4_4/SeparableConv2d/separable_conv2d" precision="FP16" type="Convolution">
			<data auto_pad="valid" dilations="1,1" group="1" kernel="1,1" output="384" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>384</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
			<blobs>
				<weights offset="532336" size="294912"/>
				<biases offset="827248" size="768"/>
			</blobs>
		</layer>
		<layer id="54" name="conv4_4/Relu6_1" precision="FP16" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>384</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="conv4_4/Conv_1/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="64" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
			<blobs>
				<weights offset="828016" size="49152"/>
				<biases offset="877168" size="128"/>
			</blobs>
		</layer>
		<layer id="56" name="conv4_4/Add" precision="FP16" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="conv4_5/Conv/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="384" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>384</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
			<blobs>
				<weights offset="877296" size="49152"/>
				<biases offset="926448" size="768"/>
			</blobs>
		</layer>
		<layer id="58" name="conv4_5/Relu6" precision="FP16" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>384</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="conv4_5/SeparableConv2d/separable_conv2d/depthwise" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="384" kernel="3,3" output="384" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>384</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
			<blobs>
				<weights offset="927216" size="6912"/>
			</blobs>
		</layer>
		<layer id="60" name="conv4_5/SeparableConv2d/separable_conv2d" precision="FP16" type="Convolution">
			<data auto_pad="valid" dilations="1,1" group="1" kernel="1,1" output="384" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>384</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
			<blobs>
				<weights offset="934128" size="294912"/>
				<biases offset="1229040" size="768"/>
			</blobs>
		</layer>
		<layer id="61" name="conv4_5/Relu6_1" precision="FP16" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>384</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="conv4_5/Conv_1/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="64" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1229808" size="49152"/>
				<biases offset="1278960" size="128"/>
			</blobs>
		</layer>
		<layer id="63" name="conv4_5/Add" precision="FP16" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="conv4_6/Conv/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="384" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>384</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1279088" size="49152"/>
				<biases offset="1328240" size="768"/>
			</blobs>
		</layer>
		<layer id="65" name="conv4_6/Relu6" precision="FP16" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>384</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="conv4_6/SeparableConv2d/separable_conv2d/depthwise" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="384" kernel="3,3" output="384" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>384</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1329008" size="6912"/>
			</blobs>
		</layer>
		<layer id="67" name="conv4_6/SeparableConv2d/separable_conv2d" precision="FP16" type="Convolution">
			<data auto_pad="valid" dilations="1,1" group="1" kernel="1,1" output="384" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>384</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1335920" size="294912"/>
				<biases offset="1630832" size="768"/>
			</blobs>
		</layer>
		<layer id="68" name="conv4_6/Relu6_1" precision="FP16" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>384</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="conv4_6/Conv_1/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="64" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1631600" size="49152"/>
				<biases offset="1680752" size="128"/>
			</blobs>
		</layer>
		<layer id="70" name="conv4_6/Add" precision="FP16" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="pixel_cls/score_from_conv4_3/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="2" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>2</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1680880" size="256"/>
				<biases offset="94540" size="4"/>
			</blobs>
		</layer>
		<layer id="72" name="conv4_7/Conv/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="384" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>384</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1681136" size="49152"/>
				<biases offset="1730288" size="768"/>
			</blobs>
		</layer>
		<layer id="73" name="conv4_7/Relu6" precision="FP16" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>384</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="conv4_7/SeparableConv2d/separable_conv2d/depthwise" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="384" kernel="3,3" output="384" pads_begin="0,0" pads_end="1,1" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>384</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1731056" size="6912"/>
			</blobs>
		</layer>
		<layer id="75" name="conv4_7/SeparableConv2d/separable_conv2d" precision="FP16" type="Convolution">
			<data auto_pad="valid" dilations="1,1" group="1" kernel="1,1" output="384" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>384</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1737968" size="294912"/>
				<biases offset="2032880" size="768"/>
			</blobs>
		</layer>
		<layer id="76" name="conv4_7/Relu6_1" precision="FP16" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>384</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="conv4_7/Conv_1/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="96" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>384</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>96</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2033648" size="73728"/>
				<biases offset="2107376" size="192"/>
			</blobs>
		</layer>
		<layer id="78" name="conv5_1/Conv/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="576" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>576</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2107568" size="110592"/>
				<biases offset="2218160" size="1152"/>
			</blobs>
		</layer>
		<layer id="79" name="conv5_1/Relu6" precision="FP16" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>576</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>576</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="conv5_1/SeparableConv2d/separable_conv2d/depthwise" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="576" kernel="3,3" output="576" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>576</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>576</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2219312" size="10368"/>
			</blobs>
		</layer>
		<layer id="81" name="conv5_1/SeparableConv2d/separable_conv2d" precision="FP16" type="Convolution">
			<data auto_pad="valid" dilations="1,1" group="1" kernel="1,1" output="576" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>576</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>576</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2229680" size="663552"/>
				<biases offset="2893232" size="1152"/>
			</blobs>
		</layer>
		<layer id="82" name="conv5_1/Relu6_1" precision="FP16" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>576</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>576</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="conv5_1/Conv_1/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="96" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>576</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>96</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2894384" size="110592"/>
				<biases offset="3004976" size="192"/>
			</blobs>
		</layer>
		<layer id="84" name="conv5_1/Add" precision="FP16" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>96</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="conv5_2/Conv/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="576" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>576</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3005168" size="110592"/>
				<biases offset="3115760" size="1152"/>
			</blobs>
		</layer>
		<layer id="86" name="conv5_2/Relu6" precision="FP16" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>576</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>576</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="conv5_2/SeparableConv2d/separable_conv2d/depthwise" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="576" kernel="3,3" output="576" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>576</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>576</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3116912" size="10368"/>
			</blobs>
		</layer>
		<layer id="88" name="conv5_2/SeparableConv2d/separable_conv2d" precision="FP16" type="Convolution">
			<data auto_pad="valid" dilations="1,1" group="1" kernel="1,1" output="576" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>576</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>576</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3127280" size="663552"/>
				<biases offset="3790832" size="1152"/>
			</blobs>
		</layer>
		<layer id="89" name="conv5_2/Relu6_1" precision="FP16" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>576</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>576</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="conv5_2/Conv_1/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="96" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>576</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>96</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3791984" size="110592"/>
				<biases offset="3902576" size="192"/>
			</blobs>
		</layer>
		<layer id="91" name="conv5_2/Add" precision="FP16" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>96</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="pixel_cls/score_from_conv5_3/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="2" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>2</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3902768" size="384"/>
				<biases offset="94540" size="4"/>
			</blobs>
		</layer>
		<layer id="93" name="conv5_3/Conv/Conv2D" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="1,1" output="576" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>576</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3903152" size="110592"/>
				<biases offset="4013744" size="1152"/>
			</blobs>
		</layer>
		<layer id="94" name="conv5_3/Relu6" precision="FP16" type="Clamp">
			<data max="6" min="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>576</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>576</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="conv5_3/SeparableConv2d/separable_conv2d/depthwise" precision="FP16" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="576" kernel="3,3" output="576" pads_begin="0,0" pads_end="1,1" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>576</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>576</dim>
					<dim>24</dim>
					<dim>40</dim>
				</port>
			</output>
			<blobs>
				<weights offset="4014896" size="10368"/>
			</blobs>
		</layer>
		<layer id="96" name="conv5_3/SeparableConv2d/separable_conv2d" precision="FP16" type="Convolution">
			<data auto_pad="valid" dilations="1,1" group="1" kernel="1,1" output="576" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>576</dim>
					<dim>24</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>576</dim>
					<dim>24</dim>
					<dim>40</dim>
				</port>
			</output>
			<blobs>
				<weights offset="4025264" size="663552"/>
				<biases offset="4688816" size="1152"/>
			</blobs>
		</layer>
		<layer id="97" name="conv5_3/Relu6_1" precision="FP16" type="Clamp">
